[
    {
        "index": 0,
        "date": "Jul 21, 2023",
        "title": "[NEW FEATURE] Timestamping management allowing synchronized network, or not.",
        "url": "https://github.com/Luos-io/luos_engine/issues/444",
        "poster_name": "#444\n            opened Jul 21, 2023 by\n            nicolas-rabault",
        "description": "Details\nLuos engine have been made for simple microcontrollers. Since version 3.0.0, Luos have been unleashed and able to run anywhere and use any network.\nHistorically to manage timestamping Luos was considering that no synchronization was available among the nodes. This is not true anymore because some advanced network can rely on time synchronization.\nDescribe the expected behavior of the feature\nTo be able to benefits from these synchronized network we have to be able to remove the latency based timestamping and use a plain date instead. This need to be a phy choice depending on it's capabilities.\nthis will be a boolean value stored in the luos_phy_t struct. This boolean will change the behavior of the Phy_ComputeMsgTimestamp, instead of computing the differential value we will just return the plain timestamp.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 1,
        "date": "Jul 17, 2023",
        "title": "[NEW FEATURE] WebSocket Network",
        "url": "https://github.com/Luos-io/luos_engine/issues/443",
        "poster_name": "#443\n            opened Jul 17, 2023 by\n            nicolas-rabault",
        "description": "What feature would you like to be included in Luos?\nAdd a webSocket network allowing to use IP networks.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 👍\n1\n Simonbdy reacted with thumbs up emoji\n\n\n \nAll reactions\n\n\n\n\n👍\n1 reaction",
        "comments": []
    },
    {
        "index": 2,
        "date": "Jul 17, 2023",
        "title": "[NEW FEATURE] Serial network support on Windows and Linux.",
        "url": "https://github.com/Luos-io/luos_engine/issues/442",
        "poster_name": "#442\n            opened Jul 17, 2023 by\n            nicolas-rabault",
        "description": "What feature would you like to be included in Luos?\nMake sure that the Native HAL for Serial Network of Luos 3.0.0 is working properly.\nDescribe the expected behavior of the feature\nWe should have the same behavior that the Mac version.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 👍\n1\n Simonbdy reacted with thumbs up emoji\n\n\n \nAll reactions\n\n\n\n\n👍\n1 reaction",
        "comments": []
    },
    {
        "index": 3,
        "date": "Jul 17, 2023",
        "title": "[BUG] Multi-threaded services with Luos V3",
        "url": "https://github.com/Luos-io/luos_engine/issues/441",
        "poster_name": "#441\n            opened Jul 17, 2023 by\n            nicolas-rabault",
        "description": "Which version the bug has been detected on\nLuos engine 3.0.0\nDescription of the bug\nHaving a multithreaded access to Luos generate some data race conditions.\nHow to reproduce the bug\nThe easiest way to reproduced it is to run a native Gate websocket with Luos 3.0.0. Make sure by looking in the main that the code is executed ion separated threads.\nGate is specially good for this because the complete project (Gate + Pipe) is using callback and polling methods resulting in a big mess...\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 4,
        "date": "Jul 17, 2023",
        "title": "[BUG] Arduino crash with Serial Network communication",
        "url": "https://github.com/Luos-io/luos_engine/issues/440",
        "poster_name": "#440\n            opened Jul 17, 2023 by\n            nicolas-rabault",
        "description": "Which version the bug has been detected on\nLuos engine 3.0.0\nDescription of the bug\nBy running simple Gate <=> service configuration using Serial network on Arduino, I experienced some communication failures\nContext and environment\nArduino hosting a led or a button service\nA native Gate websocket using Serial Network\nHow to reproduce the bug\nFollow the context and environment described above and try to use pyluos to get the routing table.\nThe detection will fail.\nPossible solution\nI started to debug this and I see that the first Gate detections seems to be OK. But when Pyluos perform another one, Serial seems to break. Serial object may be created another time at detection resulting in a Serial failure situation.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 5,
        "date": "Jul 17, 2023",
        "title": "[BUG] Native Serial_network Gate websocket segfault.",
        "url": "https://github.com/Luos-io/luos_engine/issues/439",
        "poster_name": "#439\n            opened Jul 17, 2023 by\n            nicolas-rabault",
        "description": "Which version the bug has been detected on\n*Luos engine 3.0.0\nDescription of the bug\nBy executing a gate websocket in a native environment using Serial network communication with a board I experience some random segfault.\nI removed the service multithreading on the main but I still have the same behavior.\nI tried to check it, but it doesn't seem to occur in debug mode.\nContext and environment\nA native gate websockeet connected through a Serial Network with a simple button on any board running on Luos_engine 3.0.0\nHow to reproduce the bug\nFollow the context and environment condition, connect to the gate using pyluos. You should see the gate and the button. Wait a bit and you should see the gate segfault on the Gate terminal few minutes later.\nPossible solution\nWill have to print debug and try to reproduce this bug in other situations than Gate to have a better understanding on the bug condition.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 6,
        "date": "Mar 31, 2023",
        "title": "[BUG] Native streaming asserts with windows",
        "url": "https://github.com/Luos-io/luos_engine/issues/432",
        "poster_name": "#432\n            opened Mar 31, 2023 by\n            JeromeGalan",
        "description": "Details\nWhich version the bug has been detected on\nLuos engine 2.9.0\nDescription of the bug\nAfter a few minutes in native environment ONLY WITH WINDOWS (ie Mac & Liinux  are OK):\nASSERT on line 63 of \"luos_engine\\engine\\core\\src\\streaming.c\"\nContext and environment\n\nNative with 3 three services in 3 native nodes : a gate, a button and a led\n\nHow to revproduce the bug\nJust wait a bit.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 7,
        "date": "Mar 22, 2023",
        "title": "[NEW FEATURE] Multiple kind of network",
        "url": "https://github.com/Luos-io/luos_engine/issues/429",
        "poster_name": "#429\n            opened Mar 22, 2023 by\n            nicolas-rabault",
        "description": "Multiple kind of network\nBased on #428 , the multi-phy feature will allow Luos engine to deal with multiple and different networks at the same time (WiFi, CAN, Robus, …), acting like a switch. This feature will allow to deal with multiple networks on your device, multiply data bandwidth, and break the frontier between your embedded networks and your cloud or computer applications.\nTo allow that :\n\nReception context is saved in the phy side allowing parallel reception.\nPhy add/remove is managed the same way services are.\nEvery phy have its own TX_job list (message to transmit to a target).\nThe node is considered as a phy (this is the localhost transportation interface)\nFiltering is able to filter messages for any phy interface.\nRX messages are filtered to all phy and converted into phy TX_job if needed.\nNo more dynamical size variability over time in messages allocation.\n\n\n\nUser point of view\nThis new version should not change anything on the service development side. A few API may be changed but services algorithm shouldn't change at all.\nUsers will have to add physical layers on the main.c the same way they are managing services (only by calling phy init).\nExpected results\nIn the end of this project, we should have Luos services on a computer and multiple board able to exchange information and detect  each other using serial communication over USB and Robus at the same time.\nAll services across all network should appear as a global unified architecture in the routing table.\nTasks :\n\n Manage phy instanciation and dynamical phy table management\n Deal with hardware flexible node_id listing\n Deal with hardware efficient RX\n Deal with hardware efficient TX\n Simplify msg_alloc by removing reallocation.\n Move msg_alloc tasks to phy structs\n Modify luos_tasks to become localhost TX_job list.\n Deal with filtering. node_id and service_id for each phy is indexed on the phy struct.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 8,
        "date": "Mar 22, 2023",
        "title": "[NEW FEATURE] Any kind of network support",
        "url": "https://github.com/Luos-io/luos_engine/issues/428",
        "poster_name": "#428\n            opened Mar 22, 2023 by\n            nicolas-rabault",
        "description": "Any kind of network support\nThe main goal of this feature is to drastically simplify the addition of various networks’ support into the Luos engine library. Luos engine will not be limited to the Robus network layer anymore, and will be able to deal with any kind of network.\nThe closure of this issue will lead to the creation of a v3.0.0 release of Luos.\n\n\nUser point of view\nThis new version should not change anything on the service development side. A few API may be changed but services algorithm shouldn't change at all.\nUsers may have more options on the transportation layer side allowing them to choose different ones depending on there configuration.\nUsers can design there own transportation layer allowing to deal with custom one.\nTransportation layer should be considered as kind of packages.\nExpected results\nIn the end of this project, we should have Luos services on a computer and a board able to exchange information and detect using serial communication over USB.\nTasks :\n\n Move files from Robus to IO folder (msg_alloc, filtering, reception, ...)\n Rename files functions and check for unit tests\n Check for configuration files\n Add an IO init and loop functions\n Add a phy struct gathering physical layers informations\n Simplify rx msg_allocation by adding a buffer on the phy struct\n Also use buffer to manage RX treatment out of IRQ\n Add a topology IO management function\n Create phy.h function template\n\n Manage init / loop interface\n Manage reception interface\n Manage detection interface\n Manage transmission interface\n\n\n Create phy interface for Robus\n Unit tests of Luos V3\n Hardware test of Luos V3\n Create phy interface for serial USB\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 9,
        "date": "Mar 22, 2023",
        "title": "[NEW FEATURE] Multi-phy support",
        "url": "https://github.com/Luos-io/luos_engine/issues/427",
        "poster_name": "#427\n            opened Mar 22, 2023 by\n            nicolas-rabault",
        "description": "Multi-phy support\nToday Luos use Robus as physical transportation.\nRobus is able to deal with various half-duplex physical network and have very hard real time constraints to get very efficient results and reliability on the Luos usage.\nBut most of the time devices have multiple different network to deal with, for example to communicate with a computer or with a specific electronic board.\nThe main objective of the multi-phy support is to enable the usage of any kind of network and the ability to use multiple of them regrouped under the same software architecture.\n\n\nHere is the complete expected code architecture :\n\n\nStep 1 : Any kind of network #428\nBefore thinking about how to deal with multiple physical transportation, we need to actually support different ones. So the first step goal is to make Luos work with or without Luos.\nIn the end of this Step, we should have Luos services on a computer and a board exchanging information using serial communication over USB.\n\n\nStep 2 : Multiple kind of network #429\nIn Step 1 we created the support of any kind of network, but we only can use one of them. Now it's time to allow users to have multiple network.\nIn the end of this step, we should have Luos services on a computer exchanging information using serial communication over USB and multiple boards exchanging information using serial communication over USB with the computer service and Robus with services on other boards.\n\n\nStep3 : Demonstrate it by allowing a Gate service to run on a computer or a board without any difference.\nOn this last step we should be able to run a Gate service application on a computer or in an electronic board without any difference (except for performances).\nProject support :\nThis project is financially supported and motivated by 2 companies :\n3Ditex       : https://www.3ditex.com\nNimbl'bot : https://nimbl-bot.com\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 10,
        "date": "Feb 9, 2023",
        "title": "[BUG] ESP build test temporarily didn't work",
        "url": "https://github.com/Luos-io/luos_engine/issues/423",
        "poster_name": "#423\n            opened Feb 9, 2023 by\n            nicolas-rabault",
        "description": "Details\nESP build system recently change, with this change old build system also change using new tools. Those tool doesn't seems to work on windows.\nWe had to remove the build of ESP on GH just to bypass it.\nWe have to put it back when these tool will work.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 11,
        "date": "Nov 18, 2022",
        "title": "[NEW FEATURE] Luos updates to be launched by Pyluos and not by Gate",
        "url": "https://github.com/Luos-io/luos_engine/issues/405",
        "poster_name": "#405\n            opened Nov 18, 2022 by\n            BiliouriV",
        "description": "Before to begin\nThank you for contributing to the Luos project!\nBefore to begin, please ensure that the feature you are requesting doesn't exist yet (you can use the GitHub searchbar with keywords to look for other issues).\nIf you only have a usage question, ask it to the Luos Community.\nAt last, feel free to read the Luos contribution's guidelines and the documentation page to have more insight about how to contribute to Luos!\nDetails\nPlease replace the italic test by your inputs and details in each of the following sections:\nWhat feature would you like to be included in Luos?\nUpdates should be initiated by a Pyluos Command and not by default in gate after the end of a detection\nDescribe the expected behavior of the feature\nIn Pyluos each time we finish a detection by default we should launch the updates in order to get the values we need of each node. Right now its the gate that does this automatically. In other cases as for example the detection launched before starting the bootloader we should not ask for updates because we should not provoke the collision of necessary messages that may harm the procedure.\nWhat is the motivation / use case for changing the behavior?\nThe first bootloader message that puts the boards in APP_RELOAD_MODE does not always arrives to every node because of unecessary updates that should not exist in that case. Anyways the gate should not ask by default for the updates. The updates when we use gate to get them are only used in high level (for example when we use pyluos) so it is on high level that we should ask the nodes to start sending them.\nThank you! Your issue will be reviewed by our admins.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 12,
        "date": "Nov 18, 2022",
        "title": "[NEW FEATURE]  Command to demand the nodes' Bootloader Mode",
        "url": "https://github.com/Luos-io/luos_engine/issues/404",
        "poster_name": "#404\n            opened Nov 18, 2022 by\n            BiliouriV",
        "description": "Before to begin\nThank you for contributing to the Luos project!\nBefore to begin, please ensure that the feature you are requesting doesn't exist yet (you can use the GitHub searchbar with keywords to look for other issues).\nIf you only have a usage question, ask it to the Luos Community.\nAt last, feel free to read the Luos contribution's guidelines and the documentation page to have more insight about how to contribute to Luos!\nDetails\nPlease replace the italic test by your inputs and details in each of the following sections:\nWhat feature would you like to be included in Luos?\nIt would be nice to have a message sent from Pyluos  and Gate in order to demand each node's bootloader mode.\nDescribe the expected behavior of the feature\nPyluos before starting the uploading procedure should verify the bootloader mode of each node. We should be able to check that the mode is in APP_RELOAD_MODE in order to start the procedure.\nWhat is the motivation / use case for changing the behavior?\nIn case that we have a busy network with a lot of messages like updates, it is possible that the first message when we want to reflash the boards is not received by the corresponding board (Collisions etc). For this reason we need to verify if the message is received and resend it if not.\nThank you! Your issue will be reviewed by our admins.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 13,
        "date": "Nov 15, 2022",
        "title": "[NEW FEATURE] Luos engine working with low consumtion routine",
        "url": "https://github.com/Luos-io/luos_engine/issues/403",
        "poster_name": "#403\n            opened Nov 15, 2022 by\n            Salem-Tho",
        "description": "Luos need to works with product that not always run the execution loop of a firmware.\nIn low consumption product at the end of a loop a \"sleep function\" can be call to stop the processor and enter in low consumption mode. Often the MCU is wake by a interruption provide from a peripheral like a timer, an IO, or a reception of a byte on usart.\nLuos should have in the HAL, a function to start the sleep routine to put the MCU in sleep mode and the possibility to trigger an event to wake the MCU and start the routine of going out of the sleep mode.\nAt the end the loop, a luos API should be call by user. this function will block the loop process, finish to treat msg and message handling calling, send a message to all service to but them in sleep mode and enter in sleep mode.\nThe loop process can retrieve in by a timer to wake up periodically the MCU , with the PTP by poking nodes or directly with the reception of a byte on robus\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 14,
        "date": "Oct 20, 2022",
        "title": "[BUG] PTP stucked to high level during booltloader data transfer",
        "url": "https://github.com/Luos-io/luos_engine/issues/391",
        "poster_name": "#391\n            opened Oct 20, 2022 by\n            JeromeGalan",
        "description": "Details\nPlease replace the italic test by your inputs and details in each of the following sections:\nWhich version the bug has been detected on\nLuos engine 2.6.4\nDescription of the bug\nThe PTP is stucked to HIGH level after a 2nd flash with pyluos bootloader.\n\nContext and environment\nGate L0 + Nucleo L432KC with a LED service\nHow to reproduce the bug\nThe Nucleo was in bootloader mode. A Led service has been flashed with pyluos bootloader. We try to flash it a second time with the same service.\nPossible solution\nMaybe we should do a \"pyluos-bootloader reset\" before each bootloader flash ? Or even call a reset automatically in bootloader machine state ?\nTo be verified : is it specified in the documentation ?\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 15,
        "date": "Sep 15, 2022",
        "title": "Use Ack information (timeout and framing error)[NEW FEATURE]",
        "url": "https://github.com/Luos-io/luos_engine/issues/364",
        "poster_name": "#364\n            opened Sep 15, 2022 by\n            Salem-Tho",
        "description": "an robus ackwnoledge protocol is composed by :\n\nidentifier : 0xF Always this value in case to detect a wrong byte\nrx_error : CRC wrong\nrx_timeout : timeout receive before ACK\nrx_framing_error : flag framing error is raise during the reception (possible collision with another frame)\n\nOnly rx error is used to \"ACK or NACK\" a frame the two other one is just information and we should use it and maybe add a new flag for user information\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 16,
        "date": "Sep 7, 2022",
        "title": "[NEW FEATURE] CRC_IBM",
        "url": "https://github.com/Luos-io/luos_engine/issues/360",
        "poster_name": "#360\n            opened Sep 7, 2022 by\n            Salem-Tho",
        "description": "A CRC calculation on Luos can be change to correspond to standard CRC-16 ANSI / IBM\nActual Luos CRC\n\nWidth = 16 bits\nTruncated polynomial = 0x0007\nInitial value = 0xFFFF\nInput data is NOT reflected\nOutput CRC is NOT reflected\nNo XOR is performed on the output CRC\n\nCRC-16 ANSI / IBM\n\nWidth = 16 bits\nTruncated polynomial = 0x8005\nInitial value = 0x0000\nInput data is reflected\nOutput CRC is reflected\nNo XOR is performed on the output CRC\n\ncode example:\n`uint16_t crc16_ibm(char* data, unsigned int data_len)\n{\nuint16_t crc = 0;\nif (data_len == 0)\n    return 0;\n\nfor (unsigned int i = 0; i < data_len; ++i) {\n    uint16_t dbyte = bit_reflect(data[i], 8);\n    crc ^= dbyte << 8;\n    \n    for (unsigned char j = 0; j < 8; ++j) {\n        uint16_t mix = crc & 0x8000;\n        crc = (crc << 1);\n        if (mix)\n            crc = crc ^ 0x8005;\n    }\n}\n\nreturn bit_reflect(crc, 16);\n\n}`\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 17,
        "date": "Aug 12, 2022",
        "title": "[MCU PORTING] RP2040",
        "url": "https://github.com/Luos-io/luos_engine/issues/334",
        "poster_name": "#334\n            opened Aug 12, 2022 by\n            ThotAlion",
        "description": "What MCU would you like Luos to be compatible with?\nRP2040\nLink the datasheet of this MCU:\nhttps://datasheets.raspberrypi.com\nDescribe your project:\nAfter several tests on RPi Pico, Pico W and Arduino Nano RP2040, this chip appears as very powerful with a classical architecture (M0 cortex *2). The advantage of RP2040 with respect to others ESP32 or SAMD21 is the price and the big community of Raspberry Pi behind.\nDedicated, in the future to education.\nDescribe the electronic board hosting the MCU:\nsee the Raspberry Pi Pico W :\nsee the Arduino Nano RP2040 : https://docs.arduino.cc/hardware/nano-rp2040-connect\nsee the Seeeduino XIAO RP2040 : https://www.seeedstudio.com/XIAO-RP2040-v1-0-p-5026.html\nEnsure that every box bellow is checked:\n\n[ x] The MCU is not in the compatible list in the documentation.\n[ x] The MCU is not already in an existing porting issue.\n The issue has the label porting.\n[x ] The issue is added to the Porting project.\n\nAdditional context\nAdd any other context about the porting request here.\nRP2040 ported in Arduino IDE and Platform IO with the MBed framework.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 👍\n1\n nicolas-rabault reacted with thumbs up emoji\n\n\n \nAll reactions\n\n\n\n\n👍\n1 reaction",
        "comments": []
    },
    {
        "index": 18,
        "date": "Jul 28, 2022",
        "title": "[NEW FEATURE] Luos on NuttX RTOS",
        "url": "https://github.com/Luos-io/luos_engine/issues/293",
        "poster_name": "#293\n            opened Jul 28, 2022 by\n            nicolas-rabault",
        "description": "Luos is already able to run on RTOS\nIt should be a nice idea to have a POSIX port to use OS peripherals. NuttX is following many of Linux ideas, then it will be easier test thing on Linux and then just compile it for NuttX.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 👍\n1\n acassis reacted with thumbs up emoji\n ❤️\n1\n btashton reacted with heart emoji\n\n\n \nAll reactions\n\n\n\n\n👍\n1 reaction\n\n\n❤️\n1 reaction",
        "comments": []
    },
    {
        "index": 19,
        "date": "Jul 26, 2022",
        "title": "[NEW FEATURE] Flash support for luos_engine core native HAL",
        "url": "https://github.com/Luos-io/luos_engine/issues/289",
        "poster_name": "#289\n            opened Jul 26, 2022 by\n            nicolas-rabault",
        "description": "Until now we avoid the emulation of flash on native HAL. This means that we can't use Luos in bootloader mode on a native target.\nInstead of writing binaries on a flash, we could write them on a file, then instead of jumping to another address of the flash to run the application, we could run the downloaded program.\nOn this native HAL instead of flash addresses, we should have files name allowing us to \"jump\" from one to another easily.\nThis could allow us to easily perform advanced test and validation on the bootloader in a native target.\nThis features will be really useful in the future of Luos allowing to flash computer and embedded nodes using the exact same way.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 20,
        "date": "Jul 26, 2022",
        "title": "[NEW FEATURE] Mdns support of websocket native Pipe",
        "url": "https://github.com/Luos-io/luos_engine/issues/288",
        "poster_name": "#288\n            opened Jul 26, 2022 by\n            nicolas-rabault",
        "description": "In Native example Pipe is the service dealing with the WebSocket and allowing other things to interact with the native luos_engine network.\nFor now this pipe create a WS (websocket) server and relay all input and output of the websocket to the Gate or Inspector service. This way Pyluos can send information for the Gate or Inspector trough this WS pipe.\nPyluos is able to list the compatible interfaces available on the system. For now we are able to list available serial interface, but we should be able to make it also with this WS Pipe.\nTo do that we should add an Mdns(also known as Bonjour) support on the native WS Pipe, allowing the WS Pipe to declare itself on the network to be \"discoverable\".\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 21,
        "date": "Jun 17, 2022",
        "title": "[NEW FEATURE] [POLLING] Pull messages of specific topic",
        "url": "https://github.com/Luos-io/luos_engine/issues/250",
        "poster_name": "#250\n            opened Jun 17, 2022 by\n            BiliouriV",
        "description": "What feature would you like to be included in Luos?\nWe need to have functions to check if we have into msg buffer a message of specific topic, and to pull a luos task of this topic.\nWe need  2 new Luos APIS and 1 or 2 Functions in msg alloc.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 22,
        "date": "May 17, 2022",
        "title": "[BUG] Send 2 start detection messages instead of 1",
        "url": "https://github.com/Luos-io/luos_engine/issues/229",
        "poster_name": "#229\n            opened May 17, 2022 by\n            JeromeGalan",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.2\nDescribe the bug\nWhen asking many detections with a gate and a button, the start detection is sometimes sent 2 times.\nTwo cases :\n-First image : 2 messages\n\nSecond image : the 2nd messages is broken. Only a few bytes are sent, then Tx enable goes to 0. The message is not sent on the network.\n\n\nNetwork configuration\n\nA Gate\nA Button (wirh autopupdate)\n\nHow to reproduce the bug\nAsk several detections.\nAdditional context\n\nBefore versions 2.4.2, this bug could be seen juste before the crash of an autoupdate service (issue [BUG] Assert when pulling from Tx task in case of several detections #222 is now closed).\nNow, app continue to work well. But this behaviour is weird.\nThis bug seems to appear only when there are nodes sending autoupdate messaged (to be confirmed...).\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 23,
        "date": "Apr 22, 2022",
        "title": "[BUG] Detection concurency",
        "url": "https://github.com/Luos-io/luos_engine/issues/187",
        "poster_name": "#187\n            opened Apr 22, 2022 by\n            nicolas-rabault",
        "description": "Describe the bug\nIf another node than the gate one perform a detection the Gate seems to react really weirdly.\nNetwork configuration\nA gate node and an other one performing a detection.\nHow to reproduce the bug\nI discover this bug by uploading the master node of my stair firmware.\nSo the gate is already running with nothing happening on it (just keep alive messages from Gate to computer)\nThen the master boot and launch a detection.\nThe gate seems to slow down and don't ask for any auto-update :\n\nI zoom a little bit more on the detection :\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 24,
        "date": "Apr 5, 2022",
        "title": "[BUG] At startup, unwanted pulse on PTP line crashes the network",
        "url": "https://github.com/Luos-io/luos_engine/issues/180",
        "poster_name": "#180\n            opened Apr 5, 2022 by\n            JeromeGalan",
        "description": "Describe the bug\n\nWhen a Gate is already power up (Discovery STM32-F0) and no detection have occured : if another board is hot plugged and powered by the first board, its GPIO initialisation state can accidentally crash all the networks (PTP line remains indefinitelly to 1).\n\n\nIn the picture above, network haven't crashed thanks to a new detection asked by the user. Without this detection, you're dead...\n\nMore generally, any unwanted pulse on PTP line could crash all the network.\n\nNetwork configuration\n\n\nRTB :\n┏━━━━━━━━━━━━━━━━━━━━\n┃  ╭node 1            /!\\ Not certified\n┃  │  Type                Alias               ID\n┃  ├> Gate                gate                1\n┃  ╰> Pipe                Pipe                2\n╔>┗━━━━━━━━━━━━━━━━━━━\n║     ┏━━━━━━━━━━━━━━━━━━━\n╚══ 0>┃1 ╭node 2            /!\\ Not certified\n┃  │  Type                Alias               ID\n┃  ╰> Void                boot_service\n\n┗━━━━━━━━━━━━━━━━━━━\n\n\n\nPower input configuration :\n\nA Gate is already power up (Discovery STM32-F0),\nThen, a L0 board is hotplugged and powerered-up by the STM32.\n\n\n\nHow to reproduce the bug\nPower on the STM32 and then hotplug the L0 board.\nAdditional context\nSoft should more robust to such events. Maybe you should add a filter on PTP machine state.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 25,
        "date": "Mar 16, 2022",
        "title": "[NEW FEATURE] New LuosHAL_SetIrqState",
        "url": "https://github.com/Luos-io/luos_engine/issues/166",
        "poster_name": "#166\n            opened Mar 16, 2022 by\n            Salem-Tho",
        "description": "What feature would you like to be included in Luos?\nIt's will be nice in LuosHAL in the function LuosHAL_SetIrqState(uint8_t Enable) to just enable/disable LuosHAL interrupt and anot all the interrupt of the ship\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 26,
        "date": "Dec 21, 2021",
        "title": "[NEW FEATURE] allow custom type and command enum on node_config.h and product_config.h",
        "url": "https://github.com/Luos-io/luos_engine/issues/132",
        "poster_name": "#132\n            opened Dec 21, 2021 by\n            nicolas-rabault",
        "description": "As described in the documentation, product-related definition and enums should be put on a product_config.h .\nBut if I want to create and maintain my product App type list with the Luos offset or a custom command list, this will not work because I need to include luos_list.h first.\nexample :\ntypedef enum\n{\n    MY_APPLICATION_TYPE = LUOS_LAST_TYPE,\n    MY_SENSORAPP_TYPE\n} ;\nThe product_config.h is included using -include ../product_config.h on the platformio.ini file that's why you don't have any luos related values.\nWe have to find a way to make it.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 27,
        "date": "Dec 8, 2021",
        "title": "[BUG] Gate auto-update with big RTB",
        "url": "https://github.com/Luos-io/luos_engine/issues/129",
        "poster_name": "#129\n            opened Dec 8, 2021 by\n            nicolas-rabault",
        "description": "Describe the bug\nWhen we create a lot of auto-update at the same time all the services reply in a short period of time. But after few seconds we can see that this period of time become larger and larger. The space between boards diverge.\nNetwork configuration\n\nAny\n\nHow to reproduce the bug\nJust use a gate with some service with the standard configuration\nAdditional context\nThe auto-update feature have a ms granularity. We could reduce this granularity to reduce this divergence.\nMost importantly auto-update is computed on luos_loop(). If Luos_loop is executed later after the deadline we create divergence because after send the message we do :\nnew_trigger_date = current_time + update_time\nWe should do :\nnew_trigger_date = last_trigger_date + update_time\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 28,
        "date": "Nov 8, 2021",
        "title": "[Quality Improvment] Warnings in Luos code",
        "url": "https://github.com/Luos-io/luos_engine/issues/118",
        "poster_name": "#118\n            opened Nov 8, 2021 by\n            JeromeGalan",
        "description": "On GitHub Action \"BUILD\" workflow, all Luos repository are correctly compiled, without any warning.\nBut on some OS (like Ubuntu), GCC basic parameters are generating too many warnings.\nMaybe those warnings are not relevant. But we should take a little time to think about that.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 29,
        "date": "Sep 24, 2020",
        "title": "Compil and test with all optimize option",
        "url": "https://github.com/Luos-io/luos_engine/issues/35",
        "poster_name": "#35\n            opened Sep 24, 2020 by\n            Salem-Tho",
        "description": "pb works well at O1 but not at O0 certainly du to timings and loop for or while\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 30,
        "date": "Sep 18, 2023",
        "title": "[BUG] Native compilation fails with new platformio.",
        "url": "https://github.com/Luos-io/luos_engine/issues/438",
        "poster_name": "#438\n            by nicolas-rabault\n            \n              was closed Sep 18, 2023",
        "description": "Before to begin\nThank you for contributing to the Luos project!\nBefore to begin, please ensure that this bug is an actual bug, and that it has not been reported yet (you can use the GitHub searchbar with keywords to look for other issues).\nIf you only have a usage question, ask it to the Luos Community.\nAt last, feel free to read the Luos contribution's guidelines and the documentation page to have more insight about how to contribute to Luos!\nDetails\nNative compilation fails with new platformio. It generate a datarace on path environement management on the compilation script.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 31,
        "date": "Sep 19, 2023",
        "title": "[BUG] Native don't start without broker started",
        "url": "https://github.com/Luos-io/luos_engine/issues/437",
        "poster_name": "#437\n            by nicolas-rabault\n            \n              was closed Sep 19, 2023",
        "description": "Before to begin\nThank you for contributing to the Luos project!\nBefore to begin, please ensure that this bug is an actual bug, and that it has not been reported yet (you can use the GitHub searchbar with keywords to look for other issues).\nIf you only have a usage question, ask it to the Luos Community.\nAt last, feel free to read the Luos contribution's guidelines and the documentation page to have more insight about how to contribute to Luos!\nDetails\nIf you compile and run Luos in a Native environment without Broker to only use localhost messaging Luos will block.\nWe have to timeout the connection initialization.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 32,
        "date": "Mar 31, 2023",
        "title": "[BUG] Bootloader application start address pointer is not 64-bits compliant",
        "url": "https://github.com/Luos-io/luos_engine/issues/414",
        "poster_name": "#414\n            by JeromeGalan\n            \n              was closed Mar 31, 2023",
        "description": "Which version the bug has been detected on\n2.8.0\nDescription of the bug\nIn bootloader CRC computing function :\n\"data_address\" type should be a \"void*\" pointer instead of \"uint32_t*\" in order to be 64-bits compatible\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 33,
        "date": "Mar 31, 2023",
        "title": "[BUG]: _CRITICAL  for function Recep_NodeConcerned",
        "url": "https://github.com/Luos-io/luos_engine/issues/413",
        "poster_name": "#413\n            by Salem-Tho\n            \n              was closed Mar 31, 2023",
        "description": "_WEAKED luos_localhost_t Recep_NodeConcerned(header_t *header)\nneed to be _CRITICAL\nbecause this function is call in IT\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 34,
        "date": "Dec 16, 2022",
        "title": "[BUG] Patch long message ack",
        "url": "https://github.com/Luos-io/luos_engine/issues/408",
        "poster_name": "#408\n            by Salem-Tho\n            \n              was closed Dec 16, 2022",
        "description": "Description of the bug\nDuring detection, a large message was sometimes resent 2 times and create problem in the routing table. A patch was create to prevent this issue. Recently luos face the same problem in some configuration not only on large message. the bug come from an ack not receive by the sender. This problem will be solved by make the robus protocol more soft. Thias patch can be remove from the reception file\nThank you! Your issue will be reviewed by our admins.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 35,
        "date": "Nov 8, 2022",
        "title": "BUG] Service exclusion process does not work",
        "url": "https://github.com/Luos-io/luos_engine/issues/392",
        "poster_name": "#392\n            by JeromeGalan\n            \n              was closed Nov 8, 2022",
        "description": "Which version the bug has been detected on\nLuos engine2.6.4\nDescription of the bug\nIn current implementation of service exclusion, the \"dead_spotted\" is not correctly taken into account.\nPossible solution\n\n\nWe should only excluded a node if no ACK and/or NACK has been received.\n\n\nIf there are collisions, the other node is not crashed in all cases:  maybe it can answer later or the network was oveloaded.\n\n\nFor now, exclusion is computed at service level. Maybe it should be done at node level ?\n\n\nThis routine (or an equivalent) should be add to luos in a relevant level (luos_loop ? ...?)\n// Check if there is a dead service.\nif (service->ll_service->dead_service_spotted)\n{\nConvert_ExcludedServiceData(service);\nRoutingTB_RemoveOnRoutingTable(service->ll_service->dead_service_spotted);\n// Reset spotted dead service\nservice->ll_service->dead_service_spotted = 0;\n}\n\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 36,
        "date": "Nov 8, 2022",
        "title": "[BUG] Bootloader failed when NO_RTB flag is definied in boot but not in APP",
        "url": "https://github.com/Luos-io/luos_engine/issues/389",
        "poster_name": "#389\n            by Salem-Tho\n            \n              was closed Nov 8, 2022",
        "description": "Details\nWhen you flash an application through the bootloader, if you have a bootloader binary WITHOUT the definition \"NO_RTB\" and an application WITH this define \"NO_RTB\" the first upload of the application works good! But when you try to reflash the application when you go back to the boot to reflash the application the bootloader hardfault\nThe application an the bootloader needs both to have the flag \"NO_RTB\" define  or both undefined!\nthis must be fix to be able to flash and configuration through the bootloader\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 37,
        "date": "Jan 5, 2023",
        "title": "[BUG] Timing of the ackwnoledge with STM32F4",
        "url": "https://github.com/Luos-io/luos_engine/issues/388",
        "poster_name": "#388\n            by Salem-Tho\n            \n              was closed Jan 5, 2023",
        "description": "Description of the bug\nIn the special case that you have an STM32F4 MCU in your network, you may have a problem with ack reception.\nIndeed in all other MCU, Luos use the busy flag to say if there is a byte receiving pending. for this family, there is no busy flag!\nif a byte received is pending when a timeout happens luos wait for the end of the byte before performing an end of frame. On the MCU of the F4 family, the end of frame is directly performed and the ack will not be received\nHow to reproduce the bug\nIt happen a lot when you have different MCU frequency in your network\nPossible solution\nchange Timeout to 30*bit time.\nuse detect_tx pin to catch a busy line (solution already coded but not always possible depending on user HW)\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 38,
        "date": "Oct 24, 2022",
        "title": "[BUG] Stackoverflow in ESP32",
        "url": "https://github.com/Luos-io/luos_engine/issues/386",
        "poster_name": "#386\n            by Salem-Tho\n            \n              was closed Oct 24, 2022",
        "description": "In our example sometimes an error message pop \"stack overflow on freertos task\"\nThis pb appair on ESP32 on a gate/pipe package when the function in convert.c in function Convert_JsonToMsg\nThis function is very big with a lot of line without return or break in the test case.\nTo patch a stack overflow when enter in this function a \"return\" in a if was place but it's not a real solution.\nThis function Convert_JsonToMsg must be rethink\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 39,
        "date": "Feb 3, 2023",
        "title": "[BUG] : failling detection process due to ack miss understanding",
        "url": "https://github.com/Luos-io/luos_engine/issues/385",
        "poster_name": "#385\n            by Salem-Tho\n            \n              was closed Feb 3, 2023",
        "description": "When a local routing is ask the ack of this message is not catch so the message is resend! Pb is that the node that need to send local routing understand the two time the message ask the routing table. so the local routing table is send twice.\nDuring the process of sending the global routing table, the local rtb sended twice is pull only one time and stuck in the buffer as oldest message and when the buffer is fill with the global rtb message quand go out and an assert occur\n'''\n// Send message\nuint32_t tickstart = Luos_GetSystick();\nwhile (Luos_SendMsg(service, msg) == FAILED)\n{\n// No more memory space available\n// 500ms of timeout after start trying to load our data in memory. Perhaps the buffer is full of RX messages try to increate the buffer size.\nLUOS_ASSERT(((volatile uint32_t)Luos_GetSystick() - tickstart) < 500);\n}\n'''\nit can be reproduce on stairs project when a big rtb is send and a local routing table is received twice\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 40,
        "date": "Oct 21, 2022",
        "title": "[BUG] Bootloader corrupted application issue",
        "url": "https://github.com/Luos-io/luos_engine/issues/381",
        "poster_name": "#381\n            by nicolas-rabault\n            \n              was closed Oct 21, 2022",
        "description": "If you load a corrupted application, your bootloader will jump into your curupted application always. You will have to reflash a bootloader in it to be able to reflash it again.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 41,
        "date": "Sep 27, 2022",
        "title": "[BUG] Button project for F072RB : PTP pinout does not match with nucleo board",
        "url": "https://github.com/Luos-io/luos_engine/issues/379",
        "poster_name": "#379\n            by JeromeGalan\n            \n              was closed Sep 27, 2022",
        "description": "Which version the bug has been detected on\nLuos engine 2.6.1\nDescription of the bug\nIn file :NUCLEO-F072RB/button/src/stm32f0xx_it.c\nHAL_GPIO_EXTI_IRQHandler are initialized with bad GPIO pins\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 42,
        "date": "Sep 27, 2022",
        "title": "[BUG] HAL STM32-F0 : Variable typo error in Usart IRQ handler",
        "url": "https://github.com/Luos-io/luos_engine/issues/377",
        "poster_name": "#377\n            by JeromeGalan\n            \n              was closed Sep 27, 2022",
        "description": "Which version the bug has been detected on\nLuos engine 2.6.1\nDescription of the bug\n\"data_size_to_transmit == 0\" must be replaced by \"data_size_to_transmit == 0\"\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 43,
        "date": "Nov 8, 2022",
        "title": "[BUG] Gate retrocompatibility with old Luos engine releases",
        "url": "https://github.com/Luos-io/luos_engine/issues/357",
        "poster_name": "#357\n            by JeromeGalan\n            \n              was closed Nov 8, 2022",
        "description": "Which version the bug has been detected on\nLuos engine 2.6.1\nDescription of the bug\n\nDetection error when jaunching a detection with a Gate (luos_engine 2.6.1) and other nodes with older version (2.5.1)\n\nContext and environment\n\nTested with the bike alarm project\nGate with version 2.6.2\nOther nodes with older version 2.5.1\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 44,
        "date": "Sep 16, 2022",
        "title": "[BUG] Clear REV references",
        "url": "https://github.com/Luos-io/luos_engine/issues/355",
        "poster_name": "#355\n            by JeromeGalan\n            \n              was closed Sep 16, 2022",
        "description": "Which version the bug has been detected on\nLuos engine 2.6.0\nDescription of the bug\nAll old references to \"REV\" must be cleared.\nMegaMInd has discovered this issue on Luos discord server. Thank you @Megamind#7333 :-)\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 45,
        "date": "Nov 8, 2022",
        "title": "[NEW FEATURE] Same Pipe protocol file",
        "url": "https://github.com/Luos-io/luos_engine/issues/353",
        "poster_name": "#353\n            by JeromeGalan\n            \n              was closed Nov 8, 2022",
        "description": "What feature would you like to be included in Luos?\nOnly one file is created for Serial Pipe protocol compatibility\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 46,
        "date": "Nov 4, 2022",
        "title": "[NEW FEATURE] Bootloader multicast upload binary",
        "url": "https://github.com/Luos-io/luos_engine/issues/352",
        "poster_name": "#352\n            by JeromeGalan\n            \n              was closed Nov 4, 2022",
        "description": "What feature would you like to be included in Luos?\nThe bootloader should flash the same binary on different nodes through multicast protocol\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 47,
        "date": "Sep 1, 2022",
        "title": "[BUG] ESP 32 : compilation error",
        "url": "https://github.com/Luos-io/luos_engine/issues/349",
        "poster_name": "#349\n            by JeromeGalan\n            \n              was closed Sep 1, 2022",
        "description": "Which version the bug has been detected on\nLuos engine 2.6.0\nDescription of the bug\nESP 32 projects do not compile.\nWe forgot to take into account \"feat/gateserial_esp\" branch\nLuos engine 2.6.1 will fix this problem ASAP\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 48,
        "date": "Sep 1, 2022",
        "title": "[BUG] Project barometer compilation error",
        "url": "https://github.com/Luos-io/luos_engine/issues/347",
        "poster_name": "#347\n            by JeromeGalan\n            \n              was closed Sep 1, 2022",
        "description": "Which version the bug has been detected on\nLuos engine 2.6.0\nDescription of the bug\n\nProject barometer for NUCLEO-F072RB can't compile\n\nPossible solution\n\n\nIn platformio.ini file   (\\luos_engine\\examples\\projects\\NUCLEO-F072RB\\barometer\\platformio.ini) :\n\n\nYou must change the LDF policy by adding this line :\n[env:nucleo_f072rb]\nlib_ldf_mode =off        <------ ADD THIS LINE\nplatform = ststm32\nboard = nucleo_f072rb\nframework = stm32cube\nbuild_unflags = -Os\netc...\n\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 49,
        "date": "Nov 8, 2022",
        "title": "[NEW FEATURE] Update changelog",
        "url": "https://github.com/Luos-io/luos_engine/issues/346",
        "poster_name": "#346\n            by JeromeGalan\n            \n              was closed Nov 8, 2022",
        "description": "What feature would you like to be included in Luos?\nFor next release, we could take nice ideas from arduino changelog :\nhttps://github.com/espressif/arduino-esp32/releases/tag/2.0.4\n\nName of contributors for each feature/issue/porting\nNew Contributors\nLink to contributing process\n...\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 50,
        "date": "Aug 31, 2022",
        "title": "[BUG] Ugly references to relative path",
        "url": "https://github.com/Luos-io/luos_engine/issues/333",
        "poster_name": "#333\n            by JeromeGalan\n            \n              was closed Aug 31, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.6.0\nDescribe the bug\nIt's not a bug, but it's a bug for our eyes.\nIn all platformio projects (including other luos repos), libs are references as relative path such as ../../../.. etc...\nThese relative paths should be replaced by an absolute one. It will be easier to maintain.\n*It was an idea of @K0rdan : thank you dude !\nWe could add variables in python pre-script \"LUOS_ENGINE\", \"TOOLS_SERVICES\", \"WHATEVER_YOU_WANT\" to point on abolute path and then use those references in platformio.ini\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 51,
        "date": "Nov 4, 2022",
        "title": "[BUG] Services are excluded in case of NBR_RETRY exceed only in case of collision.",
        "url": "https://github.com/Luos-io/luos_engine/issues/327",
        "poster_name": "#327\n            by nicolas-rabault\n            \n              was closed Nov 4, 2022",
        "description": "Which version the bug has been detected\nLuos engine 2.5.2\nDescribe the bug\nLuos_engine should exclude services in case of communication trouble. But in fact it seems to not exclude services that doesn't reply.\nThis is coming from this line : https://github.com/Luos-io/luos_engine/blob/main/network/robus/src/transmission.c#L131\nHow to reproduce the bug\nUse a Gate and an other node, send data to the node from the gate then unplug the node. Gate should send you an alert due to services exclusion, but it's not...\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 52,
        "date": "Aug 31, 2022",
        "title": "[BUG] GPIO_Pins and Interrupt initialized in examples should be changed",
        "url": "https://github.com/Luos-io/luos_engine/issues/326",
        "poster_name": "#326\n            by BiliouriV\n            \n              was closed Aug 31, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.2\nDescribe the bug\nIn all the examples we define a BTN_Pin and LED_Pin that may cause problems if we want to use the same pins for something else. Erase especially in Bootloader projects.\nAlso, the irq handlers which are defined at stm32xxx_it.c use the gpio pins that we have defined as ptp but not the PTPA and PTPB value so, we need to include robus_hal.h and change these values to PTPA and PTPB so that it works if we redefine the pins in node_config.h\nNetwork configuration\n\nAdd the routing table or list the nodes and their services\nPower input configuration\n\nHow to reproduce the bug\nDescribe thoroughly the steps to reproduce the bug.\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 53,
        "date": "Sep 27, 2022",
        "title": "[BUG] Some services stop receiving messages from the Gate",
        "url": "https://github.com/Luos-io/luos_engine/issues/323",
        "poster_name": "#323\n            by fleborne\n            \n              was closed Sep 27, 2022",
        "description": "Which version the bug has been detected\nLuos engine 2.5.2\nDescribe the bug\nAfter a while (several minutes), random services on the network stop receiving messages from the Gate.\nEach PCB features a LED that is lit up for one second after every command message (power_ratio) is received from the Gate. This is why I am sure that the services stop receiving commands from the Gate.\nThe services continue to send data to the Gate though. Each service generates non static data that is properly received by PyLuos.\nNetwork configuration\nIt is the same configuration as in #308.\nThe image below shows the network made of one Gate + Pipe (NUCLEO-G431KB with custom shield) and 25 custom nodes (STM32G431KB based), each one hosting one custom ServoMotor service.\nThe Gate + Pipe are powered through the USB cable. Each motor control node is powered (12 V regulated down to 3.3 V by each PCB) through the harness visible in the middle of the image (U shape).\n\nThe list of nodes and services is the following:\n  ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n  ┃  ╭node 1            /!\\ Not certified            ┃\n  ┃  │  Type                Alias               ID   ┃\n  ┃  ├> Gate                gate                1    ┃\n  ┃  ╰> Pipe                Pipe                2    ┃\n╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n╚══ 1>┃0 ╭node 2            /!\\ Not certified            ┃\n      ┃  │  Type                Alias               ID   ┃\n      ┃  ╰> ServoMotor          nb55                3    ┃\n    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n    ╚══ 1>┃0 ╭node 3            /!\\ Not certified            ┃\n          ┃  │  Type                Alias               ID   ┃\n          ┃  ╰> ServoMotor          nb551               4    ┃\n        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n        ╚══ 1>┃0 ╭node 4            /!\\ Not certified            ┃\n              ┃  │  Type                Alias               ID   ┃\n              ┃  ╰> ServoMotor          nb552               5    ┃\n            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n            ╚══ 1>┃0 ╭node 5            /!\\ Not certified            ┃\n                  ┃  │  Type                Alias               ID   ┃\n                  ┃  ╰> ServoMotor          nb553               6    ┃\n                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                ╚══ 1>┃0 ╭node 6            /!\\ Not certified            ┃\n                      ┃  │  Type                Alias               ID   ┃\n                      ┃  ╰> ServoMotor          nb554               7    ┃\n                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                    ╚══ 1>┃0 ╭node 7            /!\\ Not certified            ┃\n                          ┃  │  Type                Alias               ID   ┃\n                          ┃  ╰> ServoMotor          nb555               8    ┃\n                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                        ╚══ 1>┃0 ╭node 8            /!\\ Not certified            ┃\n                              ┃  │  Type                Alias               ID   ┃\n                              ┃  ╰> ServoMotor          nb556               9    ┃\n                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                            ╚══ 1>┃0 ╭node 9            /!\\ Not certified            ┃\n                                  ┃  │  Type                Alias               ID   ┃\n                                  ┃  ╰> ServoMotor          nb557               10   ┃\n                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                ╚══ 1>┃0 ╭node 10            /!\\ Not certified            ┃\n                                      ┃  │  Type                Alias               ID   ┃\n                                      ┃  ╰> ServoMotor          nb558               11   ┃\n                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                    ╚══ 1>┃0 ╭node 11            /!\\ Not certified            ┃\n                                          ┃  │  Type                Alias               ID   ┃\n                                          ┃  ╰> ServoMotor          nb559               12   ┃\n                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                        ╚══ 1>┃0 ╭node 12            /!\\ Not certified            ┃\n                                              ┃  │  Type                Alias               ID   ┃\n                                              ┃  ╰> ServoMotor          nb5510              13   ┃\n                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                            ╚══ 1>┃0 ╭node 13            /!\\ Not certified            ┃\n                                                  ┃  │  Type                Alias               ID   ┃\n                                                  ┃  ╰> ServoMotor          nb5511              14   ┃\n                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                ╚══ 1>┃0 ╭node 14            /!\\ Not certified            ┃\n                                                      ┃  │  Type                Alias               ID   ┃\n                                                      ┃  ╰> ServoMotor          nb5512              15   ┃\n                                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                    ╚══ 1>┃0 ╭node 15            /!\\ Not certified            ┃\n                                                          ┃  │  Type                Alias               ID   ┃\n                                                          ┃  ╰> ServoMotor          nb5513              16   ┃\n                                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                        ╚══ 1>┃0 ╭node 16            /!\\ Not certified            ┃\n                                                              ┃  │  Type                Alias               ID   ┃\n                                                              ┃  ╰> ServoMotor          nb5514              17   ┃\n                                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                            ╚══ 1>┃0 ╭node 17            /!\\ Not certified            ┃\n                                                                  ┃  │  Type                Alias               ID   ┃\n                                                                  ┃  ╰> ServoMotor          nb5515              18   ┃\n                                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                ╚══ 1>┃0 ╭node 18            /!\\ Not certified            ┃\n                                                                      ┃  │  Type                Alias               ID   ┃\n                                                                      ┃  ╰> ServoMotor          nb5516              19   ┃\n                                                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                    ╚══ 1>┃0 ╭node 19            /!\\ Not certified            ┃\n                                                                          ┃  │  Type                Alias               ID   ┃\n                                                                          ┃  ╰> ServoMotor          nb5517              20   ┃\n                                                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                        ╚══ 1>┃0 ╭node 20            /!\\ Not certified            ┃\n                                                                              ┃  │  Type                Alias               ID   ┃\n                                                                              ┃  ╰> ServoMotor          nb5518              21   ┃\n                                                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                            ╚══ 1>┃0 ╭node 21            /!\\ Not certified            ┃\n                                                                                  ┃  │  Type                Alias               ID   ┃\n                                                                                  ┃  ╰> ServoMotor          nb5519              22   ┃\n                                                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                ╚══ 1>┃0 ╭node 22            /!\\ Not certified            ┃\n                                                                                      ┃  │  Type                Alias               ID   ┃\n                                                                                      ┃  ╰> ServoMotor          nb5520              23   ┃\n                                                                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                    ╚══ 1>┃0 ╭node 23            /!\\ Not certified            ┃\n                                                                                          ┃  │  Type                Alias               ID   ┃\n                                                                                          ┃  ╰> ServoMotor          nb5521              24   ┃\n                                                                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                        ╚══ 1>┃0 ╭node 24            /!\\ Not certified            ┃\n                                                                                              ┃  │  Type                Alias               ID   ┃\n                                                                                              ┃  ╰> ServoMotor          nb5522              25   ┃\n                                                                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                            ╚══ 1>┃0 ╭node 25            /!\\ Not certified            ┃\n                                                                                                  ┃  │  Type                Alias               ID   ┃\n                                                                                                  ┃  ╰> ServoMotor          nb5523              26   ┃\n                                                                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                                ╚══ 1>┃0 ╭node 26            /!\\ Not certified            ┃\n                                                                                                      ┃  │  Type                Alias               ID   ┃\n                                                                                                      ┃  ╰> ServoMotor          nb5524              27   ┃\n                                                                                                     >┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n\n\nThe Gate and Pipe are flashed with the code found in luos_engine's examples folder, only modified to match the hardware definition and the size of the network. Their node_config.h file is\n#ifndef _NODE_CONFIG_H_\n#define _NODE_CONFIG_H_\n\n#define MAX_SERVICE_NUMBER 2\n#define MSG_BUFFER_SIZE    12288\n#define MAX_MSG_NB         128\n\n#define TX_EN_PIN GPIO_PIN_15\n#define TX_EN_PORT GPIOA\n\n#define MAX_RTB_ENTRY            80\n#define GATE_BUFF_SIZE           2048\n#define PIPE_TO_LUOS_BUFFER_SIZE 2048\n#define LUOS_TO_PIPE_BUFFER_SIZE 4096\n\n#define INIT_TIME 150\n\n#endif /* _NODE_CONFIG_H_ */\nHow to reproduce the bug\n\nSet update_time of all servomotor services to 0.075 s (~13.33 Hz)\nConfigure all servomotor services in power mode with only rot_position as feedback\nSend a power_ratio command to each servomotor, with a pause of 1 ms between each and a longer pause after the last servomotor of the network so that the update frequency matches ~13.33 Hz\n\nAdditional context\n\nnetwork statistics at the end of the test\nmonitoring the refresh_freq attribute of each PyLuos object representing a servomotor service, it appears that PyLuos continues to receive data from the Gate for all services, because all refresh_freq continue to change slightly.\n\nIn another test with only 6 servomotor services, all services except the first one stopped receiving data after 854 seconds of testing. After restarting the test without rebooting the system, the last 5 services stop receiving data after a couple seconds. Rebooting the Gate changed nothing, but rebooting the servomotor services allowed the system to work for several minutes before encountering the same issue.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 54,
        "date": "Feb 3, 2023",
        "title": "[BUG] Gate converts \"update_time\" in two different ways",
        "url": "https://github.com/Luos-io/luos_engine/issues/320",
        "poster_name": "#320\n            by fleborne\n            \n              was closed Feb 3, 2023",
        "description": "Which version the bug has been detected\nLuos engine 2.5.2\nDescribe the bug\nNot really a bug, but weird code: in the JSON to message conversion, \"update_time\" is handled twice:\n\n\n\n\nluos_engine/tool_services/gate/TinyJSON/convert.c\n\n\n         Line 551\n      in\n      efa0f98\n\n\n\n\n\n\n item = json_getProperty(jobj, \"update_time\"); \n\n\n\n\n\n\n\n\nluos_engine/tool_services/gate/TinyJSON/convert.c\n\n\n         Line 710\n      in\n      efa0f98\n\n\n\n\n\n\n item = json_getProperty(jobj, \"update_time\"); \n\n\n\n\n\n\nI don't understand whether it is a problem.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 55,
        "date": "Aug 16, 2022",
        "title": "[BUG] PyLuos bootloader fails on the last node of a network having exactly 25 nodes + Gate",
        "url": "https://github.com/Luos-io/luos_engine/issues/308",
        "poster_name": "#308\n            by fleborne\n            \n              was closed Aug 16, 2022",
        "description": "Which version the bug has been detected\nLuos engine 2.5.2\nDescribe the bug\nWhen exactly 25 nodes (in addition to the one hosting the gate and the pipe) are on the network, pyluos-bootloader fails to flash the last one of them (node ID 26), stopping at 3% of progress, when the nodes have just been flashed with the boot_service through a ST-LINK probe. This behaviour is always the same, no matter if I try to flash all nodes together or only the last node. I can reboot the network, switch the boards in the network, ..., it is always node with ID 26 that will be stuck at 3% of flashing.\nIf I isolate a subsection of the network, let's say nodes with ID 20 to 26, by disconnecting the rest of the boards, I can then flash all 7 boards normally. When I put this subsection back into the network, everything then works perfectly: I can reprogram the whole network using pyluos-bootloader.\nNetwork configuration\nThe image below shows the network made of one Gate + Pipe (NUCLEO-G431KB with custom shield) and 25 custom nodes (STM32G431KB based), each one hosting one custom ServoMotor service.\nThe Gate + Pipe are powered through the USB cable. Each motor control node is powered (12 V regulated down to 3.3 V by each PCB) through the harness visible in the middle of the image (U shape).\n\nThe list of nodes and services is the following:\n  ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n  ┃  ╭node 1            /!\\ Not certified            ┃\n  ┃  │  Type                Alias               ID   ┃\n  ┃  ├> Gate                gate                1    ┃\n  ┃  ╰> Pipe                Pipe                2    ┃\n╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n╚══ 1>┃0 ╭node 2            /!\\ Not certified            ┃\n      ┃  │  Type                Alias               ID   ┃\n      ┃  ╰> ServoMotor          nb55                3    ┃\n    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n    ╚══ 1>┃0 ╭node 3            /!\\ Not certified            ┃\n          ┃  │  Type                Alias               ID   ┃\n          ┃  ╰> ServoMotor          nb551               4    ┃\n        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n        ╚══ 1>┃0 ╭node 4            /!\\ Not certified            ┃\n              ┃  │  Type                Alias               ID   ┃\n              ┃  ╰> ServoMotor          nb552               5    ┃\n            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n            ╚══ 1>┃0 ╭node 5            /!\\ Not certified            ┃\n                  ┃  │  Type                Alias               ID   ┃\n                  ┃  ╰> ServoMotor          nb553               6    ┃\n                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                ╚══ 1>┃0 ╭node 6            /!\\ Not certified            ┃\n                      ┃  │  Type                Alias               ID   ┃\n                      ┃  ╰> ServoMotor          nb554               7    ┃\n                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                    ╚══ 1>┃0 ╭node 7            /!\\ Not certified            ┃\n                          ┃  │  Type                Alias               ID   ┃\n                          ┃  ╰> ServoMotor          nb555               8    ┃\n                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                        ╚══ 1>┃0 ╭node 8            /!\\ Not certified            ┃\n                              ┃  │  Type                Alias               ID   ┃\n                              ┃  ╰> ServoMotor          nb556               9    ┃\n                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                            ╚══ 1>┃0 ╭node 9            /!\\ Not certified            ┃\n                                  ┃  │  Type                Alias               ID   ┃\n                                  ┃  ╰> ServoMotor          nb557               10   ┃\n                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                ╚══ 1>┃0 ╭node 10            /!\\ Not certified            ┃\n                                      ┃  │  Type                Alias               ID   ┃\n                                      ┃  ╰> ServoMotor          nb558               11   ┃\n                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                    ╚══ 1>┃0 ╭node 11            /!\\ Not certified            ┃\n                                          ┃  │  Type                Alias               ID   ┃\n                                          ┃  ╰> ServoMotor          nb559               12   ┃\n                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                        ╚══ 1>┃0 ╭node 12            /!\\ Not certified            ┃\n                                              ┃  │  Type                Alias               ID   ┃\n                                              ┃  ╰> ServoMotor          nb5510              13   ┃\n                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                            ╚══ 1>┃0 ╭node 13            /!\\ Not certified            ┃\n                                                  ┃  │  Type                Alias               ID   ┃\n                                                  ┃  ╰> ServoMotor          nb5511              14   ┃\n                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                ╚══ 1>┃0 ╭node 14            /!\\ Not certified            ┃\n                                                      ┃  │  Type                Alias               ID   ┃\n                                                      ┃  ╰> ServoMotor          nb5512              15   ┃\n                                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                    ╚══ 1>┃0 ╭node 15            /!\\ Not certified            ┃\n                                                          ┃  │  Type                Alias               ID   ┃\n                                                          ┃  ╰> ServoMotor          nb5513              16   ┃\n                                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                        ╚══ 1>┃0 ╭node 16            /!\\ Not certified            ┃\n                                                              ┃  │  Type                Alias               ID   ┃\n                                                              ┃  ╰> ServoMotor          nb5514              17   ┃\n                                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                            ╚══ 1>┃0 ╭node 17            /!\\ Not certified            ┃\n                                                                  ┃  │  Type                Alias               ID   ┃\n                                                                  ┃  ╰> ServoMotor          nb5515              18   ┃\n                                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                ╚══ 1>┃0 ╭node 18            /!\\ Not certified            ┃\n                                                                      ┃  │  Type                Alias               ID   ┃\n                                                                      ┃  ╰> ServoMotor          nb5516              19   ┃\n                                                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                    ╚══ 1>┃0 ╭node 19            /!\\ Not certified            ┃\n                                                                          ┃  │  Type                Alias               ID   ┃\n                                                                          ┃  ╰> ServoMotor          nb5517              20   ┃\n                                                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                        ╚══ 1>┃0 ╭node 20            /!\\ Not certified            ┃\n                                                                              ┃  │  Type                Alias               ID   ┃\n                                                                              ┃  ╰> ServoMotor          nb5518              21   ┃\n                                                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                            ╚══ 1>┃0 ╭node 21            /!\\ Not certified            ┃\n                                                                                  ┃  │  Type                Alias               ID   ┃\n                                                                                  ┃  ╰> ServoMotor          nb5519              22   ┃\n                                                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                ╚══ 1>┃0 ╭node 22            /!\\ Not certified            ┃\n                                                                                      ┃  │  Type                Alias               ID   ┃\n                                                                                      ┃  ╰> ServoMotor          nb5520              23   ┃\n                                                                                    ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                    ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                    ╚══ 1>┃0 ╭node 23            /!\\ Not certified            ┃\n                                                                                          ┃  │  Type                Alias               ID   ┃\n                                                                                          ┃  ╰> ServoMotor          nb5521              24   ┃\n                                                                                        ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                        ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                        ╚══ 1>┃0 ╭node 24            /!\\ Not certified            ┃\n                                                                                              ┃  │  Type                Alias               ID   ┃\n                                                                                              ┃  ╰> ServoMotor          nb5522              25   ┃\n                                                                                            ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                            ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                            ╚══ 1>┃0 ╭node 25            /!\\ Not certified            ┃\n                                                                                                  ┃  │  Type                Alias               ID   ┃\n                                                                                                  ┃  ╰> ServoMotor          nb5523              26   ┃\n                                                                                                ╔>┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n                                                                                                ║     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n                                                                                                ╚══ 1>┃0 ╭node 26            /!\\ Not certified            ┃\n                                                                                                      ┃  │  Type                Alias               ID   ┃\n                                                                                                      ┃  ╰> ServoMotor          nb5524              27   ┃\n                                                                                                     >┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n\n\nThe Gate and Pipe are flashed with the code found in luos_engine's examples folder, only modified to match the hardware definition and the size of the network. Their node_config.h file is\n#ifndef _NODE_CONFIG_H_\n#define _NODE_CONFIG_H_\n\n#define MAX_SERVICE_NUMBER 2\n#define MSG_BUFFER_SIZE    8192\n#define MAX_MSG_NB         80\n\n#define TX_EN_PIN GPIO_PIN_15\n#define TX_EN_PORT GPIOA\n\n#define MAX_RTB_ENTRY            80\n#define GATE_BUFF_SIZE           2048\n#define PIPE_TO_LUOS_BUFFER_SIZE 2048\n#define LUOS_TO_PIPE_BUFFER_SIZE 4096\n\n#define INIT_TIME 150\n\n#endif /* _NODE_CONFIG_H_ */\nHow to reproduce the bug\n\nusing a ST-LINK v2 probe, flash the bootloader (from luos_engine examples) on each of the 25 boards\nflash all boards using pyluos-bootloader: pyluos-bootloader flash <port> -t {2..26} -b <firmware.bin>\nthe process gets stuck at 3% of flashing the last node (ID 26)\n\nAdditional context\n\nThere is no issue if the network has 24 or 26 motor control nodes instead of 25.\nFlashing the app directly (ST-LINK) on each board works well, so there is no issue with the hardware configuration of the custom motor controllers.\nAll 25 boot_services are always correctly detected, even after a failed flash attempt (no hard reboot needed)\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ❤️\n1\n nicolas-rabault reacted with heart emoji\n\n\n \nAll reactions\n\n\n\n\n❤️\n1 reaction",
        "comments": []
    },
    {
        "index": 56,
        "date": "Aug 10, 2022",
        "title": "[BUG] Add critical define for IRQ function",
        "url": "https://github.com/Luos-io/luos_engine/issues/300",
        "poster_name": "#300\n            by Salem-Tho\n            \n              was closed Aug 10, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.2\nDescribe the bug\nTo work on pio ESP32 exemple need to declarate some function call in IRQ with an attribut \"INRAM_ATTR\". In luos library every function that is call in IRQ will have a prefix \"critical\" define\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 57,
        "date": "Aug 10, 2022",
        "title": "[BUG] ESP32 fix HAL",
        "url": "https://github.com/Luos-io/luos_engine/issues/299",
        "poster_name": "#299\n            by Salem-Tho\n            \n              was closed Aug 10, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.2\nDescribe the bug\nPb with atomic function of the HAL\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 58,
        "date": "Aug 16, 2022",
        "title": "[MCU PORTING] L4S5",
        "url": "https://github.com/Luos-io/luos_engine/issues/297",
        "poster_name": "#297\n            by Salem-Tho\n            \n              was closed Aug 16, 2022",
        "description": "What MCU would you like Luos to be compatible with?\nLink the datasheet of this MCU:\nDescribe your project:\nDescribe the electronic board hosting the MCU:\nAdd details about the network interface, the pins used, the device, etc.\nDon't hesitate to post a schematic.\nEnsure that every box bellow is checked:\n\n The MCU is not in the compatible list in the documentation.\n The MCU is not already in an existing porting issue.\n The issue has the label porting.\n The issue is added to the Porting project.\n\nAdditional context\nAdd any other context about the porting request here.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 59,
        "date": "Mar 31, 2023",
        "title": "[NEW FEATURE] Secure OD structure usage avoiding users to directly set it",
        "url": "https://github.com/Luos-io/luos_engine/issues/295",
        "poster_name": "#295\n            by nicolas-rabault\n            \n              was closed Mar 31, 2023",
        "description": "Object Dictionary are important to keep your application loosly coupled, see : https://www.luos.io/blog/why-is-standardized-data-so-important-in-embedded-systems\nsee documentation : https://www.luos.io/docs/luos-technology/message/object-dictionary\nsee concerned folder : https://github.com/Luos-io/luos_engine/tree/main/engine/OD\nTo make Object Dictionary useful we need to be sure that users never directly write on OD (Object Dictionary) variables. If they do that the code become unsafe because the value will be stored with an unknown unit(or only known by the developer). OD structures should be always written using the dedicated functions forcing users to specify the used unit.\nTo do that I propose to modify the OD structure by adding a layer with a reserved var.\nFor example, instead of :\ntypedef float angular_position_t;\n\nWe should do:\ntypedef struct{\n    float private;\n} angular_position_t;\n\nThis way, to access the value, users have to do My_var.private = 10. This should convince them not to and to use functions instead.\nAll the functions of the OD will be able to use the private var to write or return a converted value.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 60,
        "date": "Jan 5, 2023",
        "title": "[NEW FEATURE] ESP Pipe with WS + Mdns on arduino example",
        "url": "https://github.com/Luos-io/luos_engine/issues/294",
        "poster_name": "#294\n            by nicolas-rabault\n            \n              was closed Jan 5, 2023",
        "description": "Long time ago we had a support of WS + Mdns using ESP and Pyluos.\nNow ESP is completely integrated to Luos so we have to revive this and put it on a Pipe service.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 61,
        "date": "Mar 31, 2023",
        "title": "[NEW FEATURE] Native support",
        "url": "https://github.com/Luos-io/luos_engine/issues/292",
        "poster_name": "#292\n            by nicolas-rabault\n            \n              was closed Mar 31, 2023",
        "description": "Why\nLuos_engine is made to work in a bare metal embedded environment. So, to get started with this technology, you will need at least a computer and a supported dev board.\nFind a board and plug it can be a drop condition for a new user.\nThe Native support goal is to allow people to test the technology without needing anything other than a computer.\nThis issue will be considered closed when all the training tutorials will be completely compatible with a Native target.\nConstraints\nThe way things work has to be as close as it is when we use it on embedded targets.\nWe will have to keep the Luos_engine code base clean. No exception on this part of the code will be allowed. The only place where we can do native-specific things is on HAL and service code.\nHere is a Global representation of Luos_engine layers :\n\nCreating a Luos engine Core HAL will be straightforward. We only need a systick and can ignore Flash management for now because the bootloader is not part of the training tutorial yet.\nToday, there is only one available network called Robus. This network has been thought to work on a half-duplex serial network, so we will have to create a native HAL for Robus to emulate this serial connection through TCP/IP.\nWe will have to create a specific native HAL (in green) like that :\n\nLuos define a node as an MCU on the network. In the native target, we could have multiple binaries running on the same CPU; each running binary will be considered a node.\nUsed protocols\nData exchange\nRobus rely on multipoint broadcast communication. Every message sent will be received by every node on the network simultaneously (by neglecting propagation time). We will have to emulate this by broadcasting information to every service available on the network.\nWe will use the WebSocket protocol to send and receive information. WebSocket will allow us to be future-proof and to make things run on web interfaces.\nDiscovering\nLuos also need to be able to detect other nodes on the network. Robus use PTP lines to manage and find the topology. Those PTP lies allow us to daisy chain the nodes and to know which node is connected to which node, giving us a deterministic topology of the system.\nBecause native target nodes are binary and not physical parts, we can't use any physical specificities to create a deterministic topology. We will have to find another way.\nFor now, Luos and Robus are still highly coupled, and the way Luos works could be a problem for this detection feature. We will probably have to do some dirty hacks to make it work. This is ok only if we keep it on services and HAL.\nMdns is massively used to declare a service on a TCP/IP network. We could use that.\nPear to Pear libraries seems to be able to discover pears and create a list sorted by \"distance\". This list could be deterministic... Those libs also deal with pear data exchange.\nDevelopment steps\nBefore a complete setup, we must be able to compile a minimal Luos_engine binary working on a native target.\nStep 1:\nSo the first step will be to compile an example only using localhost (internal to the binary) communication.\nThis step has its issue with more details: #290\nStep 2:\nThen we can actually work on developing a native HAL able to communicate on the Robus HAL.\nThis step has its issue with more details: #291\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 62,
        "date": "Mar 31, 2023",
        "title": "[NEW FEATURE] Native step 2 : Multiple nodes running",
        "url": "https://github.com/Luos-io/luos_engine/issues/291",
        "poster_name": "#291\n            by nicolas-rabault\n            \n              was closed Mar 31, 2023",
        "description": "In this second step of the Native development, our goal is to be able to run multiple Luos_engine binaries (nodes) to be able to list them during detection, and to make them communicate. We consider the step 1 ( #290 ) as completed\nOr final goal will be to have the button running on another node that the Gate and still be able to catch it on the pyluos side :\n\nTo do that, our main focus will be on the Robus HAL.\nCommunication\nTo exchange information it could be great to rely on WebSocket and to be able to broadcast to all off them information. For broadcasting we could use MQTT with a broadcast topic.\nThis part is open to contribution and brainstorming\nDetection\nWe will need to find a way to list other services and to send them node ID. To send them Id we need to be able to send a non broadcast message. If We use MQTT each node could create a topic with it's node name allowing anyone to reach this specific service.\nThis part is open to contribution and brainstorming\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 63,
        "date": "Sep 27, 2022",
        "title": "[NEW FEATURE] Native step 1 :  Button + Gate + Pipe binary working with pyluos",
        "url": "https://github.com/Luos-io/luos_engine/issues/290",
        "poster_name": "#290\n            by nicolas-rabault\n            \n              was closed Sep 27, 2022",
        "description": "In this first step of the Native development, our goal is to create a relevant example proving that a single Luos binary (equivalent to a single node) can work with the existing tools available in the Luos ecosystem.\nExample to develop\nFor this first example, we will create a binary with a Button, a Gate/Inspector, and a Pipe :\n\nHAL\nLuos_engine core HAL\nIn this HAL, we have to deal with systick and flash. We will avoid the flash functions for now because we don't need to support the bootloader feature yet. In the future, we could emulate the flash with a file and be able to execute it (see #289 ).\nRobus HAL\nFor this first step, in this HAL, we only need to fake message transmissions. Other functions can be void.\nButton\nThe button service will use the space key of the keyboard to change its state.\nGate and Inspector\nGate and Inspector are app services. They don't rely on any hardware. Meaning they can be compiled and work without any modifications.\nPipe\nGate/Inspector will use Pipe to exchange information with pyluos. We will have to make this Pipe use WebSocket instead of the classical Serial communication. This work will be usable for the development of the Robus Native HAL on step 2 of the native development.\nAlso, this Pipe could be able to declare itself on the network allowing pyluos to discover the available pipe on the network (see #288 )\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 64,
        "date": "Feb 3, 2023",
        "title": "[NEW FEATURE] Combatibility",
        "url": "https://github.com/Luos-io/luos_engine/issues/287",
        "poster_name": "#287\n            by JeromeGalan\n            \n              was closed Feb 3, 2023",
        "description": "When a user update Luos Engine to a newer version, Luos doesn't compile easily if there are important changes (example : API, a variable name ...). For example, some users have difficulties when \"container\" has been replaced by \"services\".\nWe  should find a way to expressively show a warning to user.\nBy showing him the important differences between his version and the latest,  it would be easier to migrate between versions.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 65,
        "date": "Aug 10, 2022",
        "title": "[NEW FEATURE] Error on MAX_CONTAINER_NUMBER because it's deprecated",
        "url": "https://github.com/Luos-io/luos_engine/issues/285",
        "poster_name": "#285\n            by nicolas-rabault\n            \n              was closed Aug 10, 2022",
        "description": "We should generate a compilation error in case MAX_CONTAINER_NUMBER is used because it's deprecated.\nSpotted by @fleborne.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 66,
        "date": "Aug 10, 2022",
        "title": "[BUG] avoid profile unknown msg filtering",
        "url": "https://github.com/Luos-io/luos_engine/issues/282",
        "poster_name": "#282\n            by nicolas-rabault\n            \n              was closed Aug 10, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.2\nDescribe the bug\nIf a profile created service receive an unknown message, this message is filtered blocking the usage of this message to the user side.\nHow to reproduce the bug\nSend an unknown message to a profile service.\nAdditional context\nThis bug has been spotted by @fleborne\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 67,
        "date": "Nov 4, 2022",
        "title": "[NEW FEATURE] Native support",
        "url": "https://github.com/Luos-io/luos_engine/issues/281",
        "poster_name": "#281\n            by nicolas-rabault\n            \n              was closed Nov 4, 2022",
        "description": "It could be interesting to support native compilation allowing to try luos without any board.\nThe main objective could be to completely follow the Get Started tutorial without any board.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 68,
        "date": "Jul 7, 2022",
        "title": "[NEW FEATURE] add some telemetry to luos_engine",
        "url": "https://github.com/Luos-io/luos_engine/issues/278",
        "poster_name": "#278\n            by nicolas-rabault\n            \n              was closed Jul 7, 2022",
        "description": "This telemetry will allow the Luos team to learn more about user usage.\nThis telemetry can be disabled.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 69,
        "date": "Aug 16, 2022",
        "title": "[MCU PORTING] STM32L0 family",
        "url": "https://github.com/Luos-io/luos_engine/issues/274",
        "poster_name": "#274\n            by Salem-Tho\n            \n              was closed Aug 16, 2022",
        "description": "What MCU would you like Luos to be compatible with?\nall the L0 family of stm32 MCU\nLink the datasheet of this MCU:\nDescribe your project:\nDescribe the electronic board hosting the MCU:\nAdd details about the network interface, the pins used, the device, etc.\nDon't hesitate to post a schematic.\nEnsure that every box bellow is checked:\n\n The MCU is not in the compatible list in the documentation.\n The MCU is not already in an existing porting issue.\n The issue has the label porting.\n The issue is added to the Porting project.\n\nAdditional context\nAdd any other context about the porting request here.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 70,
        "date": "Sep 19, 2023",
        "title": "[NEW FEATURE] Msg Alloc filtering",
        "url": "https://github.com/Luos-io/luos_engine/issues/273",
        "poster_name": "#273\n            by BiliouriV\n            \n              was closed Sep 19, 2023",
        "description": "What feature would you like to be included in Luos?\nWhen we use polling to get messages, sometimes we want to pull messages of specific characteristics, as for example a specific tardet id, a topic of message, a type, a mode etc. For this reason an idea is to create a filtering method in msg alloc to filter and pull only the messages that we need. This is done only for topic messages right now but not with filtering method.\nThe inspiration of filtering method is the same with the routing table filtering.\nHowever I am not sure if we need this feature, I have the impression that it can cause more problems than give solutions.\nIts just an idea to reconsider\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 71,
        "date": "Dec 16, 2022",
        "title": "[NEW FEATURE] BOOTLOADER app to update Bootloader",
        "url": "https://github.com/Luos-io/luos_engine/issues/272",
        "poster_name": "#272\n            by BiliouriV\n            \n              was closed Dec 16, 2022",
        "description": "What feature would you like to be included in Luos?\nA recent demand, that could be also a really cool feature of the Luos bootloader, is to create a bootloader application, that will update the bootloader. In other words, imagine that we have flashed a bootloader at the beginning of the flash, and by using it we flash our applications in the next positions of flash. Every time that we want to update an application we use the bootloader to do it. But what if our bootloader is out-of-date and we want to update it? Till now we need to flash the new bootloader using serial usb.\nIn order to update the bootloader we need create an application that will do the same procedure with the bootloader and it will be flashed by the bootloader and placed in a next position of the flash. This application will be a bootloader. The gate will send it a command to reflash the basic bootloader in the beginning. Let me better explain myself with an image:\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 72,
        "date": "Aug 31, 2022",
        "title": "[NEW FEATURE] Global routing table need or not to be send",
        "url": "https://github.com/Luos-io/luos_engine/issues/270",
        "poster_name": "#270\n            by Salem-Tho\n            \n              was closed Aug 31, 2022",
        "description": "What feature would you like to be included in Luos?\nIn many case, a node don't need to receive and store the global routing, for exemple if there is only driver services in the node.\nNow, we have to design ram message buffer to the size of global RTB in the product! it's necessary, just to accept message at detection time even if you only have one service in a node and after this phase all the space in the message buffer is useless.\nSolution :\n\nAdd in node structure a bit field with information on the node.\none of them must indicate if the node need to receive the global RTB\n\nstruct attribute((packed))\n{     // NODE mode entry\nstruct attribute((packed))\n{\nuint16_t node_id : 12;  // Node id\nuint16_t certified : 4; // True if the node have a certificate\n};\nuint16_t port_table[(MAX_ALIAS_SIZE + 2 + 2 + sizeof(uint8_t) - 2) / 2]; // Node link table\nuint8_t Node_Info//Mask of flag information\n};\n\n\nIn the mask field of Node_Info come from a define in node_config.h\n\n\nAt the of of a detection instead of sending the global routing table to all the node, the node who start the detction parse the global routing and the Node_Info bit field of each node to send or not the global routing table to the other node.\n\n\nThis way no need to filtering a spécial command in the reception just need to no send a global routing!\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 73,
        "date": "Jul 6, 2022",
        "title": "[BUG] Recep Node concerned should not return localhost for TOPIC messages",
        "url": "https://github.com/Luos-io/luos_engine/issues/268",
        "poster_name": "#268\n            by BiliouriV\n            \n              was closed Jul 6, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.0\nDescribe the bug\nSimple error of recep node concerned function in TOPIC messages that it should return MULTIHOST or EXTERNALHOST\nNetwork configuration\n\nAdd the routing table or list the nodes and their services\nPower input configuration\n\nHow to reproduce the bug\nDescribe thoroughly the steps to reproduce the bug.\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 74,
        "date": "Jul 6, 2022",
        "title": "[NEW FEATURE] Generic examples",
        "url": "https://github.com/Luos-io/luos_engine/issues/266",
        "poster_name": "#266\n            by JeromeGalan\n            \n              was closed Jul 6, 2022",
        "description": "What feature would you like to be included in Luos?\nFor QA purpose, add 3 generic examples MCUs compatible with Luos :\n\nPotentiometer\nButton\nMotor\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 75,
        "date": "Oct 24, 2022",
        "title": "[NEW FEATURE] Luos detect programming time",
        "url": "https://github.com/Luos-io/luos_engine/issues/265",
        "poster_name": "#265\n            by Salem-Tho\n            \n              was closed Oct 24, 2022",
        "description": "What feature would you like to be included in Luos?\nNeed to add a time when a detection must be lunch to avoid detection concurency\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 76,
        "date": "Sep 27, 2022",
        "title": "[BUG] Inspector searches for a GATEFORMAT",
        "url": "https://github.com/Luos-io/luos_engine/issues/264",
        "poster_name": "#264\n            by BiliouriV\n            \n              was closed Sep 27, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.0\nDescribe the bug\nWe have a warning in the compilation of inspector_serial_com because the GATEFORMAT is undefined. That is to day the select_format_script.py in gate tool is being compiled, when we want to compile an inspector. We should not compile this file! I tested buid_src_filter = -./../....select_format_script.py but it doenst work exactly like this. To review...\nNetwork configuration\n\ninspector_serial_com\n\n\nHow to reproduce the bug\ncompile inspector\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 77,
        "date": "Jul 6, 2022",
        "title": "[BUG] Bike alarm",
        "url": "https://github.com/Luos-io/luos_engine/issues/259",
        "poster_name": "#259\n            by BiliouriV\n            \n              was closed Jul 6, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.0\nDescribe the bug\nThere are some problems in the bike alarm example.\n1st the concurrent detections when all the detector boards are plugged simultaneously\n2nd the detection before the complete connection of the board when we have hot plug\n3rd update messages after START DETECTION\nNetwork configuration\n\nBike alarm nodes + gate + imu\n\nHow to reproduce the bug\nDescribe thoroughly the steps to reproduce the bug.\nAdditional context\nSolved in corresponding PR\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 78,
        "date": "Jul 5, 2022",
        "title": "[BUG] [Arduino] Missing header on Seeeduino XIAO M0",
        "url": "https://github.com/Luos-io/luos_engine/issues/257",
        "poster_name": "#257\n            by JeromeGalan\n            \n              was closed Jul 5, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.1\nDescribe the bug\nOn Seeeduino XIAO M0, a header is missing : avr/pgmspace.h\nThis header can be found here :\nframework-arduino-samd-seeed@https://github.com/Seeed-Studio/ArduinoCore-samd\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 79,
        "date": "Jul 6, 2022",
        "title": "[BUG] Gate f072rb doesnt work",
        "url": "https://github.com/Luos-io/luos_engine/issues/256",
        "poster_name": "#256\n            by BiliouriV\n            \n              was closed Jul 6, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.3\nDescribe the bug\nFrom the moment that pipe is moved to registry the gate at nucleo f0 doesnt work. I noticed that previously the pipe_com.h of f0 and l0 were different (dma channels, usart etc) and now we have only one pipe_com.h, .c for all the f0 family which are identical to pipe_com.h, .c of the previous files a l0 examples. However at f0 examples there were completely different. I think that this may causes a problem\nNetwork configuration\n\nGate at nucleo f072rb\n\nHow to reproduce the bug\n\nflash gate nucleo f072rb and launch detection\n\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 80,
        "date": "Jul 6, 2022",
        "title": "[BUG] Timestamped messages in Localhost",
        "url": "https://github.com/Luos-io/luos_engine/issues/255",
        "poster_name": "#255\n            by BiliouriV\n            \n              was closed Jul 6, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.5.0\nDescribe the bug\nWhen we are using timestamped messages in localhost the gate is not able to receive the messages.\nNetwork configuration\n\n1 node with gate pipe and button that sends timestamped messages\n\nHow to reproduce the bug\n\n1 node with gate pipe and button that sends timestamped messages\n\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 81,
        "date": "Jul 11, 2022",
        "title": "[INTERNAL BUG] [library.json] luos_engine dependancy",
        "url": "https://github.com/Luos-io/luos_engine/issues/252",
        "poster_name": "#252\n            by JeromeGalan\n            \n              was closed Jul 11, 2022",
        "description": "Describe the bug\nIn library.json, Luos engine dependency is declared like that  :\n\"dependencies\": {\n    \"luos/luos_engine\": \"Major.Minor.Patch\"\n},\n\nTheory:\n\nIf \"luos/luos_engine\" : refers to remote repository\nif  \"luos_engine\" : refers to local code\n\nIn the real life:\n\nwell, it depends...\n\nSo what ?:\nWe should find a way to have a determinist behaviour.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 82,
        "date": "Aug 31, 2022",
        "title": "[BUG]  Code quality :  cleaning",
        "url": "https://github.com/Luos-io/luos_engine/issues/251",
        "poster_name": "#251\n            by JeromeGalan\n            \n              was closed Aug 31, 2022",
        "description": "Describe the bug\nThe code need a little \"summer cleaning\" to increase its quality :\n\n Header functions: fix headers\n inc folder in project rename include\n Improve precompiled code identation\n Definitions of BTN_Pin, LED_Pin in bootloader projects should not be defined - and maybe in other examples too\n Clean bootloaders with old BOOTLOADER_MODE flags - update linkers, add WITH_BOOTLOADER flag\n Node config comment had all define changable\n Put INIT_TIME dans gate config\n Change in files and all project ID and IDACK mode to SERVICE_ID  and SERVICE_IDACK mode cf [BUG] Suggestion - ID mode renaming #246\n Rename potentiometre project in stm32l432kc\n Remove uuid definition and call in code\n Rename luos_stack_ratio to engine_msg_task\n rmv .ino to cpp\n See comments below for other actions on cleaning\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 83,
        "date": "Aug 31, 2022",
        "title": "[BUG] [Warning in PlatformIO projects] Directory \"include\" is not availaible",
        "url": "https://github.com/Luos-io/luos_engine/issues/249",
        "poster_name": "#249\n            by JeromeGalan\n            \n              was closed Aug 31, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.3\nDescribe the bug\nPlatformIO can't find \"include\" directory, so the SDK raises a warning.\nIn Luos engine PlatformIO projects, \"inc\" directories should be replaced by \"include\".\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 84,
        "date": "Jun 21, 2022",
        "title": "[BUG] [Pipe] Sample in streaming channel are removed twice",
        "url": "https://github.com/Luos-io/luos_engine/issues/248",
        "poster_name": "#248\n            by BiliouriV\n            \n              was closed Jun 21, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.3\nDescribe the bug\nThere is a problem in Pipe on Arduino. We remove the sample of streaming channel two times in a row so there is an assert because we try to delete a sample that is already deleted.  we need to erase the one of the 2.\nNetwork configuration\n\n1 gate\n\nHow to reproduce the bug\nJust use the pipe arduino in registry, flash with gate and launch pyluos-shell. We have an asser directly\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 85,
        "date": "Oct 24, 2022",
        "title": "[BUG] Suggestion - ID mode renaming",
        "url": "https://github.com/Luos-io/luos_engine/issues/246",
        "poster_name": "#246\n            by BiliouriV\n            \n              was closed Oct 24, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine X.Y.Z\nDescribe the bug\nIt is not  a bug, but it would be nice if the ID mode of Luos could be renamed to SERVICE or SERVICE_ID so that it would be easier to understand because an id can be node id topic id or service id.  That is to say we need to change every id instance in luos_engine robus and examples. This could be a part of the Luos clean of the next months\nNetwork configuration\n\nAdd the routing table or list the nodes and their services\nPower input configuration\n\nHow to reproduce the bug\nDescribe thoroughly the steps to reproduce the bug.\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 86,
        "date": "Jun 21, 2022",
        "title": "[NEW FEATURE] Multicast use",
        "url": "https://github.com/Luos-io/luos_engine/issues/242",
        "poster_name": "#242\n            by BiliouriV\n            \n              was closed Jun 21, 2022",
        "description": "What feature would you like to be included in Luos?\nThe Multicast feature is deactivated for the moment, but we need to make it work in order to have the pub/sub option in luos communication.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 87,
        "date": "Jul 6, 2022",
        "title": "[BUG] Reception : Recep_DoubleAlloc() could not work well for messages of mode TYPE and MULTICAST",
        "url": "https://github.com/Luos-io/luos_engine/issues/241",
        "poster_name": "#241\n            by BiliouriV\n            \n              was closed Jul 6, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.2\nDescribe the bug\nA clear and concise description of what the bug is.\nThe function Recep_DoubleAlloc() was made for the case of an inspector, and it double allocates memory for a service that has deactivated the filtering of messages. That is to say, a service has demanded to receive all the messages of a specif service, or every service. However in this function there is a case that we do not double allocate the message, if this message is indeed destined to this specific service.\nTo avoid double allocating the same message for the same service, we compare the ID of the filter disable service with the msg->header.target. This cannot work in case of messages of mode TYPE and MULTICAST because the target is not an ID.\nNetwork configuration\n\nAdd the routing table or list the nodes and their services\nPower input configuration\n\nHow to reproduce the bug\nDescribe thoroughly the steps to reproduce the bug.\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 88,
        "date": "Jun 21, 2022",
        "title": "[NEW FEATURE] Place bootloader after the app / jump bootloader<->app",
        "url": "https://github.com/Luos-io/luos_engine/issues/238",
        "poster_name": "#238\n            by BiliouriV\n            \n              was closed Jun 21, 2022",
        "description": "Now that we have parametrized the position of bootloader/app/shared memory in flash, we could have a feature that permits the placement of the application in the beginning of the flash, and the bootloader after.\nRight now we cannot do it, because we assume that the bootloader will always be in the beginning. But in luos engine there are already all the mechanisms we need to use to add this possibility.\nFirst the bootloader should jump to the address of the app that is in the beginning\nThen each time an application is lanced we need to check the boot flag, and if we need to we should jump to the bootloader. This process is already done into the bootloader, so we need to apply it to the application also.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 89,
        "date": "Jul 4, 2022",
        "title": "[BUG] Bootloader cannot reflash after the flash of a gate",
        "url": "https://github.com/Luos-io/luos_engine/issues/237",
        "poster_name": "#237\n            by BiliouriV\n            \n              was closed Jul 4, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.2\nDescribe the bug\nEach time we flash a gate with the bootloader, so finally we have 2 gates and 2 pipes, and we want to reflash the node, the node is not responding, so we cannot reflash. However the network continues working, if we launch a detection we still have the 2 gates and 2 pipes\nNetwork configuration\n\nand we flash with a gate binary.\nHow to reproduce the bug\nFlash 1 time with a gate binary, and then try to reflash with any binary.\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 90,
        "date": "Jan 5, 2023",
        "title": "[BUG] message acked but retransmitted anyway",
        "url": "https://github.com/Luos-io/luos_engine/issues/235",
        "poster_name": "#235\n            by nicolas-rabault\n            \n              was closed Jan 5, 2023",
        "description": "Which version the bug has been detected\nLuos engine 2.3.2\nDescribe the bug\nI'm working on a critical application that need 100% message to be sent and not 99% or 101%. In this setup I see some really rare messages received and transmitted multiple time.\nIn this specific case I spotted a message acked but retransmitted anyway :\n\nNetwork configuration\nat least 2 nodes.\nHow to reproduce the bug\nI have a data and I send the derivative form of this data. On the reception I compute the integral of this data after few time you can compare your data to see if there is any error.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 91,
        "date": "Mar 31, 2023",
        "title": "[BUG] messages not acked but still perfectly received",
        "url": "https://github.com/Luos-io/luos_engine/issues/234",
        "poster_name": "#234\n            by nicolas-rabault\n            \n              was closed Mar 31, 2023",
        "description": "Which version the bug has been detected\nLuos engine 2.3.2\nDescribe the bug\nI'm working on a critical application that need 100% message to be sent and not 99% or 101%. In this setup I see some really rare messages received and transmitted multiple time.\nIn this specific case I spotted a message NACKed but received on the user side :\n\nNetwork configuration\nat least 2 nodes.\nHow to reproduce the bug\nI have a data and I send the derivative form of this data. On the reception I compute the integral of this data after few time you can compare your data to see if there is any error.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 92,
        "date": "Jun 16, 2022",
        "title": "[BUG]  CI/CD workflow is down with last platformio core version",
        "url": "https://github.com/Luos-io/luos_engine/issues/232",
        "poster_name": "#232\n            by JeromeGalan\n            \n              was closed Jun 16, 2022",
        "description": "Describe the bug\nPlatformIO new version has changed its unit test feature.\nUnit test engine must be updated to repair the CI/CD Workflow\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 93,
        "date": "Jun 21, 2022",
        "title": "[MCU PORTING] ESP32 family",
        "url": "https://github.com/Luos-io/luos_engine/issues/226",
        "poster_name": "#226\n            by Salem-Tho\n            \n              was closed Jun 21, 2022",
        "description": "What MCU would you like Luos to be compatible with?\nESP32\nESP32-C2\nESP32-C3\nESP32-S2\nESP32-S3\nLink the datasheet of this MCU:\nhttps://www.espressif.com/en/products/modules\nDescribe your project:\nRobus and Luos HAL!  No boot loader, no alias save in flash\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 94,
        "date": "May 30, 2022",
        "title": "Put Pipe on registry",
        "url": "https://github.com/Luos-io/luos_engine/issues/224",
        "poster_name": "#224\n            by nicolas-rabault\n            \n              was closed May 30, 2022",
        "description": "** Which version the bug has been detected **\nLuos engine 2.4.2\nDescribe the bug\nToday we have a lot of duplication of Pipe even on multiple repos resulting in a big complexity when it comes to updating it or testing it. We should put it on the registry and manage networks as HAL.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 95,
        "date": "May 13, 2022",
        "title": "[BUG] Assert when pulling from Tx task in case of several detections",
        "url": "https://github.com/Luos-io/luos_engine/issues/222",
        "poster_name": "#222\n            by JeromeGalan\n            \n              was closed May 13, 2022",
        "description": "** Version the bug is detected **\nDetected in version : Luos engine rc_2.4.2\nDescribe the bug\nWhen many detections are made by a Gate, the other node asserts in msg_alloc \"MsgAlloc_PullMsgFromTxTask\" :\nLUOS_ASSERT((tx_tasks_stack_id > 0) && (tx_tasks_stack_id <= MAX_MSG_NB));\nNetwork configuration\n\nL0 : Gate + Pipe\nNucleo G4 : 15 services GPIO\n\nHow to reproduce the bug\nSend several detections, it will crash randomly in less dans 30 seconds.\nAdditional context\n\nIf we replace the Gpios by a Led (ie there are no more autoupdate), we can make thousands of detections without any trouble.\nBefore the detection that trigs the assert, the Gate sends 2 start_detections in less than 2ms. Most of times, the 2nd start detection is not entirely sent (Tx enable goes to 0) .\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 96,
        "date": "May 13, 2022",
        "title": "[BUG] Flashing a bootloader don't remove previous bootloader state.",
        "url": "https://github.com/Luos-io/luos_engine/issues/220",
        "poster_name": "#220\n            by nicolas-rabault\n            \n              was closed May 13, 2022",
        "description": "Describe the bug\nIf you try to update a bootloader directly at boot you may fall again on app. If your app is stuck it can be a problem.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 97,
        "date": "Jun 21, 2022",
        "title": "[NEW FEATURE] Add the possibility of define APP_SIZE into project's node_config.h",
        "url": "https://github.com/Luos-io/luos_engine/issues/218",
        "poster_name": "#218\n            by BiliouriV\n            \n              was closed Jun 21, 2022",
        "description": "What feature would you like to be included in Luos?\nWe need to create a #define for the size of an application in number of sectors. So when the user uses a bootloader to flash an mcu, we will directly know the sector that the application is stored and the number of sectors used to store this application. This will be really useful for the flash Erase function.\nRight now we assume that the Application binary is positioned after all the other bytes (bootloader, shared memory etc) and that we need to erase the last sectors in order to erase the application. This will not always be true, as the user has access to the parameters APP_ADDRESS, APP_ADDRESS_SECTOR, SHARED_MEMORY_SECTOR etc, so they can easily change the order of their position in flash. As a result it is not sure that the sectors we decide to erase in HAL do not contain data of the other partitions of memory, data that we may want to continue having stored.\nBy putting a default application size, and by motivating the user to redefine the size depending on their needs, we can reassure the well-functioning of Luos (and particularly in the case of a bootloader, that is the case that we erase some sectors of flash).\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 98,
        "date": "May 13, 2022",
        "title": "[BUG] Streaming can overflow",
        "url": "https://github.com/Luos-io/luos_engine/issues/217",
        "poster_name": "#217\n            by nicolas-rabault\n            \n              was closed May 13, 2022",
        "description": "Describe the bug\nSometimes Streaming seems to be able to write data outside of its buffer and make things go wrong.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 99,
        "date": "May 13, 2022",
        "title": "[BUG] RoutingTB_IDFromAlias sometime return wrong values",
        "url": "https://github.com/Luos-io/luos_engine/issues/216",
        "poster_name": "#216\n            by nicolas-rabault\n            \n              was closed May 13, 2022",
        "description": "Describe the bug\nRoutingTB_IDFromAlias sometime return wrong values and make Luos assert.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 100,
        "date": "Jun 21, 2022",
        "title": "[NEW FEATURE] Deactivate the writing of aliases into Flash memory",
        "url": "https://github.com/Luos-io/luos_engine/issues/214",
        "poster_name": "#214\n            by BiliouriV\n            \n              was closed Jun 21, 2022",
        "description": "What feature would you like to be included in Luos?\nAn existing feature of Luos which is the subscription of aliases in flash memory should be deleted from Luos_engine, because it poses problems in the  writing of applications in flash and in the functionality of bootloader.\n-Right now we reserve the last sector of the flash for the aliases that we may have defined, and that we may want to use in the future. However, it is not a functionality that is frequently needed by the users, and it is needed only in very specific projects (like in projects with numerous hot-pluged services of the same name, etc).\nProblems:\n->Up till now, as the aliases were saved in the last sector of flash, we didnt erase this sector. This causes a problem, if while using a bootloader we flash with an application binary that uses the last sector to be saved. For example a long binary application that takes maltiple sectors in order to be saved, or the example of NUCLEO-F410RB that we save directly the binary in the last flash sector. In other words, the flash of the application is not well-cleaned so the application upload fails.\n->In the same condition with the previous problem, we can overwrite the aliases with an application, or we can overwrite some application bytes, with the aliases that are saved during the execution.\nSolution\nThe best solution is to leave this feature in the users' decision. If users, developping a specific project, need to store the aliases of their services, they should write them into flash in the specific address that they want, into their user code.  So Luos will not handle the treatment of aliases, it will only change the alias in ram and it will not store it in flash.\nThe message of WRITE_ALIAS that may be sent by pyluos to the network in order to rename a service, should pass by Luos like before, so that Luos change the name of the service in the service structure, but it should also be transferred to the service. So if the user wants to stock this alias in flash, they can do it, otherwise the message will be dropped.\nFor the treatment of write alias message, as well as the writing of an alias in flash, it would be nice that we propose a tutorial, so that we could facilitate the process, and propose a solution for those that they need to use it.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 101,
        "date": "May 13, 2022",
        "title": "[BUG] [Pipe] Sometime Json data received seems to be wrong",
        "url": "https://github.com/Luos-io/luos_engine/issues/213",
        "poster_name": "#213\n            by nicolas-rabault\n            \n              was closed May 13, 2022",
        "description": "Describe the bug\nThis can be notived using bootloader resulting on a wrong CRC\nHow to reproduce the bug\nUpload something multiple time until this occure\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 102,
        "date": "May 12, 2022",
        "title": "[BUG]  Try test",
        "url": "https://github.com/Luos-io/luos_engine/issues/211",
        "poster_name": "#211\n            by JeromeGalan\n            \n              was closed May 12, 2022",
        "description": "Describe the bug\nA clear and concise description of what the bug is.\nNetwork configuration\n\nAdd the routing table or list the nodes and their services\nPower input configuration\n\nHow to reproduce the bug\nDescribe thoroughly the steps to reproduce the bug.\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 103,
        "date": "Jun 21, 2022",
        "title": "[BUG] Bootloader update for all mcus",
        "url": "https://github.com/Luos-io/luos_engine/issues/210",
        "poster_name": "#210\n            by BiliouriV\n            \n              was closed Jun 21, 2022",
        "description": "Describe the bug\nAfter the creation of luos_engine main, the bootloader should be updated and integrated in all the examples because  now it doesnt work.\nNetwork configuration\nHow to reproduce the bug\n-flash an application using the bootloader\nAdditional context\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 104,
        "date": "Jun 21, 2022",
        "title": "[MCU PORTING] Creation HAL for Mbed for SAMD21",
        "url": "https://github.com/Luos-io/luos_engine/issues/209",
        "poster_name": "#209\n            by Salem-Tho\n            \n              was closed Jun 21, 2022",
        "description": "What MCU would you like Luos to be compatible with?\nSame MCU samd21j18 but differents compiler\nDescribe your project:\nCreation of a project button for the board samd21xpro\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 105,
        "date": "May 30, 2022",
        "title": "[BUG] irq_disable replace by LuosHAL_SetIrqState",
        "url": "https://github.com/Luos-io/luos_engine/issues/208",
        "poster_name": "#208\n            by Salem-Tho\n            \n              was closed May 30, 2022",
        "description": "Describe the bug\nTo rmv depencies to CMSIS in profile we must use LuosHAL_SetIrqState\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 106,
        "date": "May 12, 2022",
        "title": "[BUG] Detection sometimes fail and make nodes crash",
        "url": "https://github.com/Luos-io/luos_engine/issues/206",
        "poster_name": "#206\n            by nicolas-rabault\n            \n              was closed May 12, 2022",
        "description": "Describe the bug\nBy making  A LOT of detection we have sometimes crashed on detected nodes\nNetwork configuration\nA Gate and a node with services on it more services seem to make the bug occurs more frequently.\nHow to reproduce the bug\nJust ask the Gate to make a lot of detections.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 107,
        "date": "May 30, 2022",
        "title": "[BUG] Cross compilation typedef struct __attribute__((__packed__))",
        "url": "https://github.com/Luos-io/luos_engine/issues/205",
        "poster_name": "#205\n            by Salem-Tho\n            \n              was closed May 30, 2022",
        "description": "Describe the bug\nbetween different compiler an enum won't take the same space in memory!\nFor example with gcc :\nan enum take the size of :\n-> uint8_t if enum < 255 uint16_t\n-> uint16_t if enum > 255\netc\nFor example with ninja:\nan enum always take the size of uint32_t:\nSo when we want to know the size of a structure for exemple, if there is a enum inside the size will be differente between compiler!\nTo patch this all the structure that contains a an enum as type of a variable must be replace by the real size of the enum:\nFor example:\ntypedef struct attribute((packed))\n{\nentry_mode_t mode;\nunion\n...\nMust be replace by\ntypedef struct attribute((packed))\n{\nuint8_t mode;//type entry_mode_t\nunion\n...\nThat way Luos will be cross compiler compatible and we manage the size of structure in a better way\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 108,
        "date": "May 30, 2022",
        "title": "[BUG] Inspector message are corrupted",
        "url": "https://github.com/Luos-io/luos_engine/issues/201",
        "poster_name": "#201\n            by JeromeGalan\n            \n              was closed May 30, 2022",
        "description": "Version\n\n[Detected]         Luos engine 2.4.1\n[Scheduled Fix] Luos engine 2.4.2\n\nDescribe the bug\nWhen we ask a detection with the SAAS, the inspector returns a bad message  (1st byte is corrupted)\nNetwork configuration\n\nA gate + an inspector\n\nHow to reproduce the bug\nJust ask a detection\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 109,
        "date": "Sep 5, 2022",
        "title": "[BUG] Autoupdate crash after detection",
        "url": "https://github.com/Luos-io/luos_engine/issues/198",
        "poster_name": "#198\n            by JeromeGalan\n            \n              was closed Sep 5, 2022",
        "description": "Describe the bug\nAfter many detections, a Node with autoupdate crashes.\nThe context is described in the following pics :\n\n\nNetwork configuration\n\nLuos test platform :\n1- Discovery F0 : Gate\n2- Nucleo L4 : 15 Gpio\n3- Nucleo G4 : Button\n\nHow to reproduce the bug\nDo many detections (random : sometimes about 20, sometimes about 200),\nAdditional context\nMost of the times the Gate sends an incomplete start detection and this event trigs the crash of Node 2. But sometimes, Node 2 is seems to be crashed without incomplete start detection.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 110,
        "date": "Feb 3, 2023",
        "title": "[NEW FEATURE] Improve Timestamp architecture by separating layers",
        "url": "https://github.com/Luos-io/luos_engine/issues/179",
        "poster_name": "#179\n            by JeromeGalan\n            \n              was closed Feb 3, 2023",
        "description": "What feature would you like to be included in Luos?\nTimestamp messages are now computed in Luos library and in Robus protocol layer.\nA better architecture could be to move all timestamp related code in Luos library layer.\nCommit Link In Luos engine release candidate 2.4.0 (to be released soon...), direct calls to \"Robus_sendMsg\" are patched in this commit :\n[PATCH] For direct access to robus_sendMsg : protocol Config is set to default](Luos-io/luos@6cc4b8f)\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 111,
        "date": "Jun 16, 2022",
        "title": "[DOC] [Apps/Gate] Some comment are outdated",
        "url": "https://github.com/Luos-io/luos_engine/issues/203",
        "poster_name": "#203\n            by fleborne\n            \n              was closed Jun 16, 2022",
        "description": "Some comments are outdated in the TinyJSON lib: \\r -> \\n.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 112,
        "date": "May 31, 2022",
        "title": "[NEW FEATURE] [Profiles] Forward all messages to user's callback",
        "url": "https://github.com/Luos-io/luos_engine/issues/176",
        "poster_name": "#176\n            by fleborne\n            \n              was closed May 31, 2022",
        "description": "In the servo motor profile (https://github.com/Luos-io/Luos/blob/master/Profiles/Servo_motor/profile_servo_motor.c#L256), if a message with an unsupported type is received, we fall in the default case and return.\nAs a consequence, the message callback implemented for a service that inherits the servo motor profile never processes such message (ie. profile->profile_ops.Callback(service, msg); is not called).\nI think it would be better not to return in the default case, as it would allow users to extend the set of supported messages.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 113,
        "date": "Apr 28, 2022",
        "title": "[BUG] Timestamp token next pointer is not initialized",
        "url": "https://github.com/Luos-io/luos_engine/issues/170",
        "poster_name": "#170\n            by JeromeGalan\n            \n              was closed Apr 28, 2022",
        "description": "A linked list is used in timestamp tokens to point to next token.\nTimestamp token \"next\" field should be equal to 0 after a \"timestamp_token_t\" declaration.\nOn x86 HAL, this field is not equals to 0 and must be initialized by the user.\nThis behaviour has not been seen on embedded boards tested, because next pointers are reseted during compilation. But can we be sure it will be done everytime ?\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 114,
        "date": "Feb 3, 2023",
        "title": "[NEW FEATURE]  Header field Change",
        "url": "https://github.com/Luos-io/luos_engine/issues/169",
        "poster_name": "#169\n            by Salem-Tho\n            \n              was closed Feb 3, 2023",
        "description": "What feature would you like to be included in Luos?\nChange positionning and name field of the header\nProtocol change to Config\nthis fiels was on the 1st byte of the frame and now goes to the 3rd byte of the frame\nNow\n4--------12--------4--------12--------8------- 8\nProto---Target----Mode----Source----cmd---size\nThen\n12--------4--------4--------12--------8------- 8\nTarget----Mode---Config---Source---cmd---size\nIn the field config there is:\n0 -> default value\n1 -> time stamped msg\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 115,
        "date": "Apr 28, 2022",
        "title": "[BUG] Header fields are not initialized",
        "url": "https://github.com/Luos-io/luos_engine/issues/168",
        "poster_name": "#168\n            by JeromeGalan\n            \n              was closed Apr 28, 2022",
        "description": "Describe the bug\nDuring a message declaration of a msg_t, header fields are initialized with random values.\nSo, if the user doesn't initialize those values, nodes can crash.\n-> \"Protocol\" field is set to random value. It will be a problem in future releases.\n-> If a user send a bad \"cmd, it can sometime have a bad behaviour on Luos network (spam the network or crash other nodes)\nCorrection proposal\n\nDuring \"msg_t\" declaration, we should find a way to initialize each field to a default value.\nAn assert must be rised when user have not properly set header fields (which fields ? --> To be defined).\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 116,
        "date": "Mar 17, 2022",
        "title": "[NEW FEATURE] Luos_SendMsgTimeStamp",
        "url": "https://github.com/Luos-io/luos_engine/issues/167",
        "poster_name": "#167\n            by Salem-Tho\n            \n              was closed Mar 17, 2022",
        "description": "What feature would you like to be included in Luos?\nLuos does not initialize field of the msg_t structure when a msg variable is create.\nIn some case, when you don't want to send with timestamps, the field may have the wrong value and will be miss interpreate by the receiver.\nwe need 2 fonction :\nLuos_SendMsg that force the field to 0\nLuos_SendMsgTimeStamp that force the field to 1\nLuos_SendMsgTimeStamp function will concatenate the 2 part of code (encode timestamps and send)\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 117,
        "date": "Sep 5, 2022",
        "title": "[NEW FEATURE] Move maximum of timestamp related code from HAL to engine",
        "url": "https://github.com/Luos-io/luos_engine/issues/164",
        "poster_name": "#164\n            by nicolas-rabault\n            \n              was closed Sep 5, 2022",
        "description": "Today we have in HAL a big part of the timestamp functions.\nWe have :\n\nll_timestamp_t structure: In my point of view this should be on Luos, HAL should only allow getting back the current timestamp. Also the only value we need to have at a global level is start_offset. lower and higher timestamp are always calculated and we don't need to keep them.\nLuosHAL_GetTimestamp: this one sounds good and should not take care about the start_offset if we consider this value as a Luos feature not related to hardware.\nLuosHAL_StartTimestamp: If we consider the start_offset value as a Luos value this function should be on Luos side. Also instead of using a ms value why don't we use a ns offset?\nLuosHAL_StopTimestamp: If we consider the start_offset value as a Luos value this function should be on Luos side. Other values don't need to be global so no need to reset them.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 118,
        "date": "Jun 29, 2022",
        "title": "[NEW FEATURE]  Bootloader erases too much Flash?",
        "url": "https://github.com/Luos-io/luos_engine/issues/150",
        "poster_name": "#150\n            by fleborne\n            \n              was closed Jun 29, 2022",
        "description": "What feature would you like to be included in Luos?\nThis issue could be related to #202\nJust before flashing a new firmware through the bootloader, the Flash is erased. In the current implementation, the whole Flash after APP_ADDRESS is erased, whereas only the pages needed to fit the new firmware could be erased.\nBecause of this behaviour, the user can't use the Flash pages located after their app to store values. Only the shared memory seems to remain unerased.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 119,
        "date": "May 31, 2022",
        "title": "[BUG] LuosHAL_EraseMemory doesn't use its size parameter.",
        "url": "https://github.com/Luos-io/luos_engine/issues/202",
        "poster_name": "#202\n            by fleborne\n            \n              was closed May 31, 2022",
        "description": "Describe the bug\nThe declaration of LuosHAL_EraseMemory is\nvoid LuosHAL_EraseMemory(uint32_t address, uint16_t size)\nbut the size parameter is not used in the function's implementation. The bootloader suffers from that while flashing a new firmware, as it erases all the flash instead of just what is needed to fit the new firmware.\nNetwork configuration\nNo specific configuration.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 120,
        "date": "Apr 28, 2022",
        "title": "[NEW FEATURE] Luos_SendStreaming API merge with Luos_SendStreamingSize in next Major release",
        "url": "https://github.com/Luos-io/luos_engine/issues/143",
        "poster_name": "#143\n            by Salem-Tho\n            \n              was closed Apr 28, 2022",
        "description": "What feature would you like to be included in Luos?\nCode Optimisation\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 121,
        "date": "Feb 22, 2022",
        "title": "[NEW FEATURE] add some filtering function to find services on routing table",
        "url": "https://github.com/Luos-io/luos_engine/issues/140",
        "poster_name": "#140\n            by nicolas-rabault\n            \n              was closed Feb 22, 2022",
        "description": "We should cumulate filters on routing table field instead of making silly research function for each case.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 122,
        "date": "Mar 31, 2023",
        "title": "[NEW FEATURE] Assert on Gate doesn't come back to Json anymore",
        "url": "https://github.com/Luos-io/luos_engine/issues/204",
        "poster_name": "#204\n            by nicolas-rabault\n            \n              was closed Mar 31, 2023",
        "description": "Since the separation between Gate and Pipe Gate don't return Gate Assert anymore.\nOn assert The node start by calling Services assert functions. Previously this function was managed by Gate and was allowing to send back assert information to the computer.\nNow the Gate still generating this message but send it to pipe. The problem is that Pipe will not be called anymore because we are on assert.\nTo solve this we should call a function of pipe that will be able to send assert information to the computer.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 123,
        "date": "Feb 3, 2022",
        "title": "[BUG] Compilation error when using platformio libraries on local computer",
        "url": "https://github.com/Luos-io/luos_engine/issues/128",
        "poster_name": "#128\n            by JeromeGalan\n            \n              was closed Feb 3, 2022",
        "description": "Describe the bug\nContext :\n\nOS : Windows.\n\"PLATFORMIO_LIB_EXTRA_DIR\" environment variable points to a local directory.\nThis local directory includes many libraries and projects. For example, it can be your local workspace directory with many differents projects, even if there are not Luos related.\n\nWhen compiling a project, PlatformIO  scans all directories pointed by PLATFORMIO_LIB_EXTRA_DIR.\nThen, PlatformIO tries to compile all directories. Maybe it believes those dir are \"libraries\"...\nSo, depending of your local directory structure, the compilation fails.\nHow to reproduce the bug\nSee context in above section.\nSuggestions\n\nTry to find a clean fix (maybe in platformio.ini ?).\nIf it's not possible, we'll have to add a specific troubleshooting chapter in the Luos documentation.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 124,
        "date": "Feb 3, 2023",
        "title": "[BUG] Actions worklows are down with last clang-format version",
        "url": "https://github.com/Luos-io/luos_engine/issues/120",
        "poster_name": "#120\n            by JeromeGalan\n            \n              was closed Feb 3, 2023",
        "description": "Describe the bug\nOn november 5th 2021, clang-format has released version 1.6.0.\nSince this date, all Luos github actions workflows which are using linting are down ( concerned repository : Luos, LuosHAL & Examples).\nAdditional context\nBefore fixing properly this problem, i have modified all worklows to old clang-format version 1.5.0. Everything seems OK, but we should fix this later.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 125,
        "date": "May 11, 2022",
        "title": "[BUG] Pyluos is stuck when there is a bad behaviour of luos detection",
        "url": "https://github.com/Luos-io/luos_engine/issues/117",
        "poster_name": "#117\n            by JeromeGalan\n            \n              was closed May 11, 2022",
        "description": "Describe the bug\nWhen connecting to a Gate, if Pyluos doesn't receive any detection from the Gate : the process is stucked in serial initialisation method. A bypass way is to disconnect and reconnect manually the serial link (usb/serial link in my case) But it's not convenient. A software fix should be usefull.\nNetwork configuration\n\nBad configuration : a MCU in Luos Network is badly initialised (so the PTP states are totally crashed).\n\nHow to reproduce the bug\nWith a network with a bad firmware loaded (specially with bad PTP configurations) , the Gate is logically not able to receive a routing table.\nAdditional context\nEven if the bug is caused by a bad user configuration, Pyluos should include a way to properly close serial link (with a software command ? A timeout ? ...).\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 👍\n1\n fleborne reacted with thumbs up emoji\n\n\n \nAll reactions\n\n\n\n\n👍\n1 reaction",
        "comments": []
    },
    {
        "index": 126,
        "date": "Jun 14, 2022",
        "title": "[BUG] Luos Statistics are not reported",
        "url": "https://github.com/Luos-io/luos_engine/issues/116",
        "poster_name": "#116\n            by JeromeGalan\n            \n              was closed Jun 14, 2022",
        "description": "Describe the bug\nWhen asking statistics with Pyluos, those statistics are often not reported to python console.\nNetwork configuration\n4 st-microelectronics MCUs (L0, F0, G4, L4) with about 20 services.\nHow to reproduce the bug\nSimply ask statistics in loop, and the bug will pop in less than a minute.\nAdditional context\nA colleague has the same bug on his Windows Dell Laptop. But in his case, he doesn't receive the statistics at all.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 127,
        "date": "Feb 3, 2022",
        "title": "[BUG] Big network issue",
        "url": "https://github.com/Luos-io/luos_engine/issues/108",
        "poster_name": "#108\n            by nicolas-rabault\n            \n              was closed Feb 3, 2022",
        "description": "Describe the bug\nWhen there is a lot of nodes on a network during the detection we copy the routing table in each node.\nThe first nodes that get this routing table are ready to send things but not the other. Potentially messages send during those copies can be ignored because routing table is not already up to date in all the nodes.\nThis could lead to a change in the behavior depending on the position of the nodes from the detector.\nNetwork configuration\nQuite a big one with a lot of nodes.\nAnd we need to have the application sending things like configuration just after the detection.\nAdditional context\nThis bug has been hidden by delaying configurations send on our demos (bike alarm and led_strip)\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 128,
        "date": "Feb 3, 2022",
        "title": "[BUG] detection reentrance on specific conditions",
        "url": "https://github.com/Luos-io/luos_engine/issues/107",
        "poster_name": "#107\n            by nicolas-rabault\n            \n              was closed Feb 3, 2022",
        "description": "Describe the bug\nIt's possible to have detection reentrance if user make the launch of a detection on an event in msg_handler triggered by a localhost service.\nFor example a button board with a button driver service and an App running a detection on push.\nWhen you push the button detection is launched from message_handler, but it's possible than the detection run Luos_Loop(). If Your button service send another information about the push of the button it could re-call the detection in the middle on detection.\nWitch is bad...\nNetwork configuration\nTo reproduce it you probably need to have quite a large network making the detection wait and call Luos_Loop\nAdditional context\nThis bug have been hidden in the detection button app from the led_strip Demo\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 129,
        "date": "Nov 30, 2021",
        "title": "[NEW FEATURE] C++ implementation?",
        "url": "https://github.com/Luos-io/luos_engine/issues/106",
        "poster_name": "#106\n            by davidefer\n            \n              was closed Nov 30, 2021",
        "description": "Hi\nI find the project cool.\nDo you plan to port it to C++? It would fit very well with your framework.\nThanks in advance\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 130,
        "date": "Apr 28, 2022",
        "title": "[WARNING] Servo motor template",
        "url": "https://github.com/Luos-io/luos_engine/issues/100",
        "poster_name": "#100\n            by JeromeGalan\n            \n              was closed Apr 28, 2022",
        "description": "On Luos project compilation, there are 2 warnings about IRQ function declarations :\nTemplates\\Servo_motor\\profile_servo_motor.c: In function 'ProfileServoMotor_Handler':\nTemplates\\Servo_motor\\profile_servo_motor.c:153:13: warning: implicit declaration of function '__disable_irq' [-Wimplicit-function-declaration]\n__disable_irq();\n^~~~~~~~~~~~~\nTemplates\\Servo_motor\\profile_servo_motor.c:156:13: warning: implicit declaration of function '__enable_irq' [-Wimplicit-function-declaration]\n__enable_irq();\n^~~~~~~~~~~~\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 131,
        "date": "Apr 28, 2022",
        "title": "Rename master to main.",
        "url": "https://github.com/Luos-io/luos_engine/issues/79",
        "poster_name": "#79\n            by tzzed\n            \n              was closed Apr 28, 2022",
        "description": "What feature would you like to be included in Luos?\nIt would be good to rename the master branch to main as the github. https://github.com/github/renaming\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 132,
        "date": "Feb 24, 2021",
        "title": "[BUG] Missing submodules",
        "url": "https://github.com/Luos-io/luos_engine/issues/72",
        "poster_name": "#72\n            by sfermigier\n            \n              was closed Feb 24, 2021",
        "description": "In the readme: This repository contains a submodule. The examples folder is linked to another repository. That means this folder won't be cloned with a regular git clone.\nThis didn't seem to be the case.\nRunning git clone --recursive https://github.com/Luos-io/Luos.git doesn't make an examples directory appear.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 133,
        "date": "Dec 4, 2020",
        "title": "Assert",
        "url": "https://github.com/Luos-io/luos_engine/issues/62",
        "poster_name": "#62\n            by nicolas-rabault\n            \n              was closed Dec 4, 2020",
        "description": "Manage assert bay sharing it on the network and update all routing table.\nManage it on gate an pyluos too;\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 134,
        "date": "Aug 19, 2021",
        "title": "First template, the State template",
        "url": "https://github.com/Luos-io/luos_engine/issues/61",
        "poster_name": "#61\n            by nicolas-rabault\n            \n              was closed Aug 19, 2021",
        "description": "Create a basic template managing a state object.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n 👍\n1\n Simonbdy reacted with thumbs up emoji\n\n\n \nAll reactions\n\n\n\n\n👍\n1 reaction",
        "comments": []
    },
    {
        "index": 135,
        "date": "Nov 17, 2020",
        "title": "bug gate detection",
        "url": "https://github.com/Luos-io/luos_engine/issues/57",
        "poster_name": "#57\n            by Salem-Tho\n            \n              was closed Nov 17, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 136,
        "date": "Nov 20, 2020",
        "title": "[MCU PORTING]",
        "url": "https://github.com/Luos-io/luos_engine/issues/56",
        "poster_name": "#56\n            by sundance14\n            \n              was closed Nov 20, 2020",
        "description": "What MCU would you like Luos to be compatible with?\nLink the datasheet of this MCU:\nDescribe your project:\nDescribe the electronic board hosting the MCU:\nAdd details about the network interface, the pins used, the device, etc.\nDon't hesitate to post a schematic.\nEnsure that every box bellow is checked:\n\n The MCU is not in the compatible list in the documentation.\n The MCU is not already in an existing porting issue.\n The issue has the label porting.\n The issue is added to the Porting project.\n\nAdditional context\nAdd any other context about the porting request here.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 137,
        "date": "Nov 17, 2020",
        "title": "Cleanup detection",
        "url": "https://github.com/Luos-io/luos_engine/issues/54",
        "poster_name": "#54\n            by nicolas-rabault\n            \n              was closed Nov 17, 2020",
        "description": "remove useless detection file\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 138,
        "date": "Nov 5, 2020",
        "title": "Manage topology detection by attributing only node_id and port table to all nodes.",
        "url": "https://github.com/Luos-io/luos_engine/issues/51",
        "poster_name": "#51\n            by nicolas-rabault\n            \n              was closed Nov 5, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 139,
        "date": "Oct 19, 2020",
        "title": "fit crc SW and HW",
        "url": "https://github.com/Luos-io/luos_engine/issues/49",
        "poster_name": "#49\n            by Salem-Tho\n            \n              was closed Oct 19, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 140,
        "date": "Oct 19, 2020",
        "title": "Rethink routing table in NODE mode to manage node ID.",
        "url": "https://github.com/Luos-io/luos_engine/issues/47",
        "poster_name": "#47\n            by nicolas-rabault\n            \n              was closed Oct 19, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 141,
        "date": "Nov 5, 2020",
        "title": "Change PTP detection",
        "url": "https://github.com/Luos-io/luos_engine/issues/45",
        "poster_name": "#45\n            by Salem-Tho\n            \n              was closed Nov 5, 2020",
        "description": "Register PTP that can be more than 2\nTruth table to have state PTP\ntime for PTP maintain up or down\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 142,
        "date": "Oct 14, 2020",
        "title": "Detection will be at robus level",
        "url": "https://github.com/Luos-io/luos_engine/issues/43",
        "poster_name": "#43\n            by Salem-Tho\n            \n              was closed Oct 14, 2020",
        "description": "discard msg with PTP\nremove from luos detection\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 143,
        "date": "Oct 19, 2020",
        "title": "Add NODE target mode management.",
        "url": "https://github.com/Luos-io/luos_engine/issues/42",
        "poster_name": "#42\n            by nicolas-rabault\n            \n              was closed Oct 19, 2020",
        "description": "Add node ID allowing to identify a specific Node.\nThis way a container can send a message to a node.\nWe also have to manage NODE target mode.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 144,
        "date": "Oct 13, 2020",
        "title": "rename route_table_t to routing_table_t",
        "url": "https://github.com/Luos-io/luos_engine/issues/40",
        "poster_name": "#40\n            by nicolas-rabault\n            \n              was closed Oct 13, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 145,
        "date": "Nov 20, 2020",
        "title": "[TOPOLOGY] Fix ROUTE TABLE to ROUTING TABLE",
        "url": "https://github.com/Luos-io/luos_engine/issues/39",
        "poster_name": "#39\n            by Simonbdy\n            \n              was closed Nov 20, 2020",
        "description": "Describe the bug\nI'm not comfortable with the use of \"route table\" instead of \"routing table\", this is a mere question of terminology, but it may be good to avoid approximate or wrong use of words at the very root of the technology, as it can only prejudice us in the future.\nNetwork configuration\nn/a\nHow to reproduce the bug\neg:\nroute_table_t route_table[MAX_containers_NUMBER];\nRouteTB_GetNodeID(unsigned short index);\ncompute_route_table_entry_nb(void);\nAdditional context\nAdd any other context about the problem here.\nDon't hesitate to add screenshots or to link an entry from the forum.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 146,
        "date": "Dec 1, 2020",
        "title": "Add an information about node ID",
        "url": "https://github.com/Luos-io/luos_engine/issues/38",
        "poster_name": "#38\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "Actually identifying a node is a mess. We should be able to determine a node by a number.\nThis allow us to manage a new kind of target_mode for node. This is extremely usefull for bootloader because bootloader doesn't really have any module...\nAlso we have to store this information in route table and or module to easily identify where is hosted a specific module.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 147,
        "date": "Dec 1, 2020",
        "title": "change ID to be on 8 bits",
        "url": "https://github.com/Luos-io/luos_engine/issues/37",
        "poster_name": "#37\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "By passing ID in 8 bit instead of 12 we can change the header struct and save 1 byte on the header because we can save 4 bit in target and source field.\nThis allow us to check if the message is for us at the second byte and we don't need more than 256 module ID.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 148,
        "date": "Feb 3, 2022",
        "title": "Type and Id liste compression to optimize research",
        "url": "https://github.com/Luos-io/luos_engine/issues/36",
        "poster_name": "#36\n            by nicolas-rabault\n            \n              was closed Feb 3, 2022",
        "description": "Currently during the reception of a message we have to loop on module table to find if we have a module concerned by this messages. This loop take time and have to be executed in IRQ...\nTo save some time defining if this message is for us or not we could check it by using masks on compressed datas of hosted modules in the node.\nTo do that the Id or Type value represent a bit decay on a specific buffer containing compressed datas of modules hosted in a node. To check if a message is for us we just have to decay a bit from the ID or TYPE received and compare it with the local compressed values we have.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 149,
        "date": "Nov 30, 2021",
        "title": "Create non blocking send function and transmit buffer",
        "url": "https://github.com/Luos-io/luos_engine/issues/32",
        "poster_name": "#32\n            by Salem-Tho\n            \n              was closed Nov 30, 2021",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 150,
        "date": "Dec 1, 2020",
        "title": "Naming function in luos library and formating file in luos library",
        "url": "https://github.com/Luos-io/luos_engine/issues/31",
        "poster_name": "#31\n            by Salem-Tho\n            \n              was closed Dec 1, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 151,
        "date": "Oct 13, 2020",
        "title": "Optimized message allocation",
        "url": "https://github.com/Luos-io/luos_engine/issues/30",
        "poster_name": "#30\n            by nicolas-rabault\n            \n              was closed Oct 13, 2020",
        "description": "Create a message allocator instead of a simple table to save some ram.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 152,
        "date": "Sep 16, 2020",
        "title": "jsqcvhy",
        "url": "https://github.com/Luos-io/luos_engine/issues/29",
        "poster_name": "#29\n            by Salem-Tho\n            \n              was closed Sep 16, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 153,
        "date": "Dec 1, 2020",
        "title": "renaming function with luosHAL convention",
        "url": "https://github.com/Luos-io/luos_engine/issues/28",
        "poster_name": "#28\n            by Salem-Tho\n            \n              was closed Dec 1, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 154,
        "date": "Dec 1, 2020",
        "title": "change module_t to container_t in to Luos",
        "url": "https://github.com/Luos-io/luos_engine/issues/25",
        "poster_name": "#25\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 155,
        "date": "May 7, 2020",
        "title": "[MCU PORTING]",
        "url": "https://github.com/Luos-io/luos_engine/issues/22",
        "poster_name": "#22\n            by youyouyoucef\n            \n              was closed May 7, 2020",
        "description": "What MCU would you like Luos to be compatible with?\nLink the datasheet of this MCU:\nDescribe your project:\nDescribe the electronic board hosting the MCU:\nAdd details about the network interface, the pins used, the device, etc.\nDon't hesitate to post a schematic.\nEnsure that every box bellow is checked:\n\n The MCU is not in the compatible list in the documentation.\n The MCU is not already in an existing porting issue.\n The issue has the label porting.\n The issue is added to the Porting project.\n\nAdditional context\nAdd any other context about the porting request here.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 156,
        "date": "Dec 1, 2020",
        "title": "[NEW FEATURE] make a clean and simple non volatile saving for aliases",
        "url": "https://github.com/Luos-io/luos_engine/issues/18",
        "poster_name": "#18\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "What feature would you like to be included in Luos?\nActually keeping aliases from a power off is a mess and is never the same depending on MCU.\nWe should make something simple but efficient and reusable.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 157,
        "date": "Apr 14, 2020",
        "title": "luos_board.h needed in main.c",
        "url": "https://github.com/Luos-io/luos_engine/issues/12",
        "poster_name": "#12\n            by AntoineVenier\n            \n              was closed Apr 14, 2020",
        "description": "We need to include \"luos_board.h\" to make\nHAL_ADC_Start_DMA(&hadc, node_analog.unmap, sizeof(node_analog_t) / sizeof(uint32_t)) work.\nNormally we should not.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 158,
        "date": "Dec 1, 2020",
        "title": "Manage Luos version on platformio side and luos side",
        "url": "https://github.com/Luos-io/luos_engine/issues/10",
        "poster_name": "#10\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "the lib revision on the platformio side should be used on Luos and sharable into the network allowing to check compatibility.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 159,
        "date": "Dec 1, 2020",
        "title": "Make Luos independant from cubemx",
        "url": "https://github.com/Luos-io/luos_engine/issues/9",
        "poster_name": "#9\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "copy all needed cubeMX generated code in hal.c file avoiding to setup properly CubeMX for each Luos based project.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 160,
        "date": "Mar 20, 2020",
        "title": "Need to add a license to make Luos Open Source",
        "url": "https://github.com/Luos-io/luos_engine/issues/8",
        "poster_name": "#8\n            by AntoineVenier\n            \n              was closed Mar 20, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 161,
        "date": "Mar 30, 2020",
        "title": "move Luos to platformio lib #8",
        "url": "https://github.com/Luos-io/luos_engine/issues/6",
        "poster_name": "#6\n            by AntoineVenier\n            \n              was closed Mar 30, 2020",
        "description": "No description provided.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 162,
        "date": "Mar 30, 2020",
        "title": "time_t structure on OD already exist",
        "url": "https://github.com/Luos-io/luos_engine/issues/4",
        "poster_name": "#4\n            by nicolas-rabault\n            \n              was closed Mar 30, 2020",
        "description": "time_t structure on OD already exist. We should rename it as time_luos_t\nWhen it's done we should use OD time functions on modules (led, gate, ...)\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 163,
        "date": "Feb 17, 2020",
        "title": "Collision manager easily fail to re-transmit messages",
        "url": "https://github.com/Luos-io/luos_engine/issues/3",
        "poster_name": "#3\n            by nicolas-rabault\n            \n              was closed Feb 17, 2020",
        "description": "In Reachy modules send datas when critical motor informations are transmited generating message collision. When collision occures critical messages transmission fail easily. We have to speed up collision detection and understand how electrical priority work.\nFirst we have to look at electrical behavior of the driver with and without pull-up.\nAfter try to secure collision detection.\nAnd finish by randomize retry delay time to avoid recollision.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 164,
        "date": "Dec 1, 2020",
        "title": "Node topological mapping sometime fail",
        "url": "https://github.com/Luos-io/luos_engine/issues/2",
        "poster_name": "#2\n            by nicolas-rabault\n            \n              was closed Dec 1, 2020",
        "description": "Sometime there is some inconsistencies on node topology mapping causing pyluos fail.\noutput module doesn't always fit with the output module input. This is because we can't check the good reception of this information during detection.\nWe have to find a way to secure it  :\n\nby securing the reception of this information\nby recompute data after and remake it clean.\n\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    },
    {
        "index": 165,
        "date": "Feb 10, 2020",
        "title": "Detection miss an ID",
        "url": "https://github.com/Luos-io/luos_engine/issues/1",
        "poster_name": "#1\n            by nicolas-rabault\n            \n              was closed Feb 10, 2020",
        "description": "Sometime a module miss an id sent by the detector module. We perhaps we could use IDACK.\n\n\n\n\n\n\n\n\n\n              The text was updated successfully, but these errors were encountered:\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nAll reactions",
        "comments": []
    }
]